/* automatically generated by rust-bindgen 0.59.1 */

pub const RTC_VERSION_MAJOR: u32 = 3;
pub const RTC_VERSION_MINOR: u32 = 13;
pub const RTC_VERSION_PATCH: u32 = 2;
pub const RTC_VERSION: u32 = 31302;
pub const RTC_VERSION_STRING: &'static [u8; 7usize] = b"3.13.2\0";
pub const RTC_MAX_INSTANCE_LEVEL_COUNT: u32 = 1;
pub const EMBREE_MIN_WIDTH: u32 = 0;
pub const RTC_MIN_WIDTH: u32 = 0;
pub const _VCRT_COMPILER_PREPROCESSOR: u32 = 1;
pub const _SAL_VERSION: u32 = 20;
pub const __SAL_H_VERSION: u32 = 180000000;
pub const _USE_DECLSPECS_FOR_SAL: u32 = 0;
pub const _USE_ATTRIBUTES_FOR_SAL: u32 = 0;
pub const _CRT_PACKING: u32 = 8;
pub const _HAS_EXCEPTIONS: u32 = 1;
pub const _STL_LANG: u32 = 0;
pub const _HAS_CXX17: u32 = 0;
pub const _HAS_CXX20: u32 = 0;
pub const _HAS_NODISCARD: u32 = 0;
pub const _ARGMAX: u32 = 100;
pub const _CRT_INT_MAX: u32 = 2147483647;
pub const _CRT_FUNCTIONS_REQUIRED: u32 = 1;
pub const _CRT_HAS_CXX17: u32 = 0;
pub const _ARM_WINAPI_PARTITION_DESKTOP_SDK_AVAILABLE: u32 = 1;
pub const _CRT_BUILD_DESKTOP_APP: u32 = 1;
pub const _CRT_INTERNAL_NONSTDC_NAMES: u32 = 1;
pub const __STDC_SECURE_LIB__: u32 = 200411;
pub const __GOT_SECURE_LIB__: u32 = 200411;
pub const __STDC_WANT_SECURE_LIB__: u32 = 1;
pub const _SECURECRT_FILL_BUFFER_PATTERN: u32 = 254;
pub const _CRT_SECURE_CPP_OVERLOAD_STANDARD_NAMES: u32 = 0;
pub const _CRT_SECURE_CPP_OVERLOAD_STANDARD_NAMES_COUNT: u32 = 0;
pub const _CRT_SECURE_CPP_OVERLOAD_SECURE_NAMES: u32 = 1;
pub const _CRT_SECURE_CPP_OVERLOAD_STANDARD_NAMES_MEMORY: u32 = 0;
pub const _CRT_SECURE_CPP_OVERLOAD_SECURE_NAMES_MEMORY: u32 = 0;
pub const true_: u32 = 1;
pub const false_: u32 = 0;
pub const __bool_true_false_are_defined: u32 = 1;
pub const RTC_MAX_TIME_STEP_COUNT: u32 = 129;
pub type size_t = ::std::os::raw::c_ulonglong;
pub type wchar_t = ::std::os::raw::c_ushort;
pub type max_align_t = f64;
pub type va_list = *mut ::std::os::raw::c_char;
extern "C" {
    pub fn __va_start(arg1: *mut *mut ::std::os::raw::c_char, ...);
}
pub type __vcrt_bool = bool;
extern "C" {
    pub fn __security_init_cookie();
}
extern "C" {
    pub fn __security_check_cookie(_StackCookie: usize);
}
extern "C" {
    pub fn __report_gsfailure(_StackCookie: usize);
}
extern "C" {
    pub static mut __security_cookie: usize;
}
pub type __crt_bool = bool;
extern "C" {
    pub fn _invalid_parameter_noinfo();
}
extern "C" {
    pub fn _invalid_parameter_noinfo_noreturn();
}
extern "C" {
    pub fn _invoke_watson(
        _Expression: *const wchar_t,
        _FunctionName: *const wchar_t,
        _FileName: *const wchar_t,
        _LineNo: ::std::os::raw::c_uint,
        _Reserved: usize,
    );
}
pub type errno_t = ::std::os::raw::c_int;
pub type wint_t = ::std::os::raw::c_ushort;
pub type wctype_t = ::std::os::raw::c_ushort;
pub type __time32_t = ::std::os::raw::c_long;
pub type __time64_t = ::std::os::raw::c_longlong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __crt_locale_data_public {
    pub _locale_pctype: *const ::std::os::raw::c_ushort,
    pub _locale_mb_cur_max: ::std::os::raw::c_int,
    pub _locale_lc_codepage: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___crt_locale_data_public() {
    assert_eq!(
        ::std::mem::size_of::<__crt_locale_data_public>(),
        16usize,
        concat!("Size of: ", stringify!(__crt_locale_data_public))
    );
    assert_eq!(
        ::std::mem::align_of::<__crt_locale_data_public>(),
        8usize,
        concat!("Alignment of ", stringify!(__crt_locale_data_public))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__crt_locale_data_public>()))._locale_pctype as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__crt_locale_data_public),
            "::",
            stringify!(_locale_pctype)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__crt_locale_data_public>()))._locale_mb_cur_max as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__crt_locale_data_public),
            "::",
            stringify!(_locale_mb_cur_max)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__crt_locale_data_public>()))._locale_lc_codepage as *const _
                as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__crt_locale_data_public),
            "::",
            stringify!(_locale_lc_codepage)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __crt_locale_pointers {
    pub locinfo: *mut __crt_locale_data,
    pub mbcinfo: *mut __crt_multibyte_data,
}
#[test]
fn bindgen_test_layout___crt_locale_pointers() {
    assert_eq!(
        ::std::mem::size_of::<__crt_locale_pointers>(),
        16usize,
        concat!("Size of: ", stringify!(__crt_locale_pointers))
    );
    assert_eq!(
        ::std::mem::align_of::<__crt_locale_pointers>(),
        8usize,
        concat!("Alignment of ", stringify!(__crt_locale_pointers))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__crt_locale_pointers>())).locinfo as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__crt_locale_pointers),
            "::",
            stringify!(locinfo)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__crt_locale_pointers>())).mbcinfo as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__crt_locale_pointers),
            "::",
            stringify!(mbcinfo)
        )
    );
}
pub type _locale_t = *mut __crt_locale_pointers;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _Mbstatet {
    pub _Wchar: ::std::os::raw::c_ulong,
    pub _Byte: ::std::os::raw::c_ushort,
    pub _State: ::std::os::raw::c_ushort,
}
#[test]
fn bindgen_test_layout__Mbstatet() {
    assert_eq!(
        ::std::mem::size_of::<_Mbstatet>(),
        8usize,
        concat!("Size of: ", stringify!(_Mbstatet))
    );
    assert_eq!(
        ::std::mem::align_of::<_Mbstatet>(),
        4usize,
        concat!("Alignment of ", stringify!(_Mbstatet))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_Mbstatet>()))._Wchar as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_Mbstatet),
            "::",
            stringify!(_Wchar)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_Mbstatet>()))._Byte as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_Mbstatet),
            "::",
            stringify!(_Byte)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_Mbstatet>()))._State as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(_Mbstatet),
            "::",
            stringify!(_State)
        )
    );
}
pub type mbstate_t = _Mbstatet;
pub type time_t = __time64_t;
pub type rsize_t = size_t;
pub type _ino_t = ::std::os::raw::c_ushort;
pub type ino_t = _ino_t;
pub type _dev_t = ::std::os::raw::c_uint;
pub type dev_t = _dev_t;
pub type _off_t = ::std::os::raw::c_long;
pub type off_t = _off_t;
pub type ssize_t = ::std::os::raw::c_longlong;
pub const RTCFormat_RTC_FORMAT_UNDEFINED: RTCFormat = 0;
pub const RTCFormat_RTC_FORMAT_UCHAR: RTCFormat = 4097;
pub const RTCFormat_RTC_FORMAT_UCHAR2: RTCFormat = 4098;
pub const RTCFormat_RTC_FORMAT_UCHAR3: RTCFormat = 4099;
pub const RTCFormat_RTC_FORMAT_UCHAR4: RTCFormat = 4100;
pub const RTCFormat_RTC_FORMAT_CHAR: RTCFormat = 8193;
pub const RTCFormat_RTC_FORMAT_CHAR2: RTCFormat = 8194;
pub const RTCFormat_RTC_FORMAT_CHAR3: RTCFormat = 8195;
pub const RTCFormat_RTC_FORMAT_CHAR4: RTCFormat = 8196;
pub const RTCFormat_RTC_FORMAT_USHORT: RTCFormat = 12289;
pub const RTCFormat_RTC_FORMAT_USHORT2: RTCFormat = 12290;
pub const RTCFormat_RTC_FORMAT_USHORT3: RTCFormat = 12291;
pub const RTCFormat_RTC_FORMAT_USHORT4: RTCFormat = 12292;
pub const RTCFormat_RTC_FORMAT_SHORT: RTCFormat = 16385;
pub const RTCFormat_RTC_FORMAT_SHORT2: RTCFormat = 16386;
pub const RTCFormat_RTC_FORMAT_SHORT3: RTCFormat = 16387;
pub const RTCFormat_RTC_FORMAT_SHORT4: RTCFormat = 16388;
pub const RTCFormat_RTC_FORMAT_UINT: RTCFormat = 20481;
pub const RTCFormat_RTC_FORMAT_UINT2: RTCFormat = 20482;
pub const RTCFormat_RTC_FORMAT_UINT3: RTCFormat = 20483;
pub const RTCFormat_RTC_FORMAT_UINT4: RTCFormat = 20484;
pub const RTCFormat_RTC_FORMAT_INT: RTCFormat = 24577;
pub const RTCFormat_RTC_FORMAT_INT2: RTCFormat = 24578;
pub const RTCFormat_RTC_FORMAT_INT3: RTCFormat = 24579;
pub const RTCFormat_RTC_FORMAT_INT4: RTCFormat = 24580;
pub const RTCFormat_RTC_FORMAT_ULLONG: RTCFormat = 28673;
pub const RTCFormat_RTC_FORMAT_ULLONG2: RTCFormat = 28674;
pub const RTCFormat_RTC_FORMAT_ULLONG3: RTCFormat = 28675;
pub const RTCFormat_RTC_FORMAT_ULLONG4: RTCFormat = 28676;
pub const RTCFormat_RTC_FORMAT_LLONG: RTCFormat = 32769;
pub const RTCFormat_RTC_FORMAT_LLONG2: RTCFormat = 32770;
pub const RTCFormat_RTC_FORMAT_LLONG3: RTCFormat = 32771;
pub const RTCFormat_RTC_FORMAT_LLONG4: RTCFormat = 32772;
pub const RTCFormat_RTC_FORMAT_FLOAT: RTCFormat = 36865;
pub const RTCFormat_RTC_FORMAT_FLOAT2: RTCFormat = 36866;
pub const RTCFormat_RTC_FORMAT_FLOAT3: RTCFormat = 36867;
pub const RTCFormat_RTC_FORMAT_FLOAT4: RTCFormat = 36868;
pub const RTCFormat_RTC_FORMAT_FLOAT5: RTCFormat = 36869;
pub const RTCFormat_RTC_FORMAT_FLOAT6: RTCFormat = 36870;
pub const RTCFormat_RTC_FORMAT_FLOAT7: RTCFormat = 36871;
pub const RTCFormat_RTC_FORMAT_FLOAT8: RTCFormat = 36872;
pub const RTCFormat_RTC_FORMAT_FLOAT9: RTCFormat = 36873;
pub const RTCFormat_RTC_FORMAT_FLOAT10: RTCFormat = 36874;
pub const RTCFormat_RTC_FORMAT_FLOAT11: RTCFormat = 36875;
pub const RTCFormat_RTC_FORMAT_FLOAT12: RTCFormat = 36876;
pub const RTCFormat_RTC_FORMAT_FLOAT13: RTCFormat = 36877;
pub const RTCFormat_RTC_FORMAT_FLOAT14: RTCFormat = 36878;
pub const RTCFormat_RTC_FORMAT_FLOAT15: RTCFormat = 36879;
pub const RTCFormat_RTC_FORMAT_FLOAT16: RTCFormat = 36880;
pub const RTCFormat_RTC_FORMAT_FLOAT2X2_ROW_MAJOR: RTCFormat = 37154;
pub const RTCFormat_RTC_FORMAT_FLOAT2X3_ROW_MAJOR: RTCFormat = 37155;
pub const RTCFormat_RTC_FORMAT_FLOAT2X4_ROW_MAJOR: RTCFormat = 37156;
pub const RTCFormat_RTC_FORMAT_FLOAT3X2_ROW_MAJOR: RTCFormat = 37170;
pub const RTCFormat_RTC_FORMAT_FLOAT3X3_ROW_MAJOR: RTCFormat = 37171;
pub const RTCFormat_RTC_FORMAT_FLOAT3X4_ROW_MAJOR: RTCFormat = 37172;
pub const RTCFormat_RTC_FORMAT_FLOAT4X2_ROW_MAJOR: RTCFormat = 37186;
pub const RTCFormat_RTC_FORMAT_FLOAT4X3_ROW_MAJOR: RTCFormat = 37187;
pub const RTCFormat_RTC_FORMAT_FLOAT4X4_ROW_MAJOR: RTCFormat = 37188;
pub const RTCFormat_RTC_FORMAT_FLOAT2X2_COLUMN_MAJOR: RTCFormat = 37410;
pub const RTCFormat_RTC_FORMAT_FLOAT2X3_COLUMN_MAJOR: RTCFormat = 37411;
pub const RTCFormat_RTC_FORMAT_FLOAT2X4_COLUMN_MAJOR: RTCFormat = 37412;
pub const RTCFormat_RTC_FORMAT_FLOAT3X2_COLUMN_MAJOR: RTCFormat = 37426;
pub const RTCFormat_RTC_FORMAT_FLOAT3X3_COLUMN_MAJOR: RTCFormat = 37427;
pub const RTCFormat_RTC_FORMAT_FLOAT3X4_COLUMN_MAJOR: RTCFormat = 37428;
pub const RTCFormat_RTC_FORMAT_FLOAT4X2_COLUMN_MAJOR: RTCFormat = 37442;
pub const RTCFormat_RTC_FORMAT_FLOAT4X3_COLUMN_MAJOR: RTCFormat = 37443;
pub const RTCFormat_RTC_FORMAT_FLOAT4X4_COLUMN_MAJOR: RTCFormat = 37444;
pub const RTCFormat_RTC_FORMAT_GRID: RTCFormat = 40961;
pub type RTCFormat = ::std::os::raw::c_int;
pub const RTCBuildQuality_RTC_BUILD_QUALITY_LOW: RTCBuildQuality = 0;
pub const RTCBuildQuality_RTC_BUILD_QUALITY_MEDIUM: RTCBuildQuality = 1;
pub const RTCBuildQuality_RTC_BUILD_QUALITY_HIGH: RTCBuildQuality = 2;
pub const RTCBuildQuality_RTC_BUILD_QUALITY_REFIT: RTCBuildQuality = 3;
pub type RTCBuildQuality = ::std::os::raw::c_int;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct RTCBounds {
    pub lower_x: f32,
    pub lower_y: f32,
    pub lower_z: f32,
    pub align0: f32,
    pub upper_x: f32,
    pub upper_y: f32,
    pub upper_z: f32,
    pub align1: f32,
}
#[test]
fn bindgen_test_layout_RTCBounds() {
    assert_eq!(
        ::std::mem::size_of::<RTCBounds>(),
        32usize,
        concat!("Size of: ", stringify!(RTCBounds))
    );
    assert_eq!(
        ::std::mem::align_of::<RTCBounds>(),
        16usize,
        concat!("Alignment of ", stringify!(RTCBounds))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCBounds>())).lower_x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCBounds),
            "::",
            stringify!(lower_x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCBounds>())).lower_y as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCBounds),
            "::",
            stringify!(lower_y)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCBounds>())).lower_z as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCBounds),
            "::",
            stringify!(lower_z)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCBounds>())).align0 as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCBounds),
            "::",
            stringify!(align0)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCBounds>())).upper_x as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCBounds),
            "::",
            stringify!(upper_x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCBounds>())).upper_y as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCBounds),
            "::",
            stringify!(upper_y)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCBounds>())).upper_z as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCBounds),
            "::",
            stringify!(upper_z)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCBounds>())).align1 as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCBounds),
            "::",
            stringify!(align1)
        )
    );
}
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct RTCLinearBounds {
    pub bounds0: RTCBounds,
    pub bounds1: RTCBounds,
}
#[test]
fn bindgen_test_layout_RTCLinearBounds() {
    assert_eq!(
        ::std::mem::size_of::<RTCLinearBounds>(),
        64usize,
        concat!("Size of: ", stringify!(RTCLinearBounds))
    );
    assert_eq!(
        ::std::mem::align_of::<RTCLinearBounds>(),
        16usize,
        concat!("Alignment of ", stringify!(RTCLinearBounds))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCLinearBounds>())).bounds0 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCLinearBounds),
            "::",
            stringify!(bounds0)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCLinearBounds>())).bounds1 as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCLinearBounds),
            "::",
            stringify!(bounds1)
        )
    );
}
pub const RTCIntersectContextFlags_RTC_INTERSECT_CONTEXT_FLAG_NONE: RTCIntersectContextFlags = 0;
pub const RTCIntersectContextFlags_RTC_INTERSECT_CONTEXT_FLAG_INCOHERENT: RTCIntersectContextFlags =
    0;
pub const RTCIntersectContextFlags_RTC_INTERSECT_CONTEXT_FLAG_COHERENT: RTCIntersectContextFlags =
    1;
pub type RTCIntersectContextFlags = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RTCFilterFunctionNArguments {
    pub valid: *mut ::std::os::raw::c_int,
    pub geometryUserPtr: *mut ::std::os::raw::c_void,
    pub context: *mut RTCIntersectContext,
    pub ray: *mut RTCRayN,
    pub hit: *mut RTCHitN,
    pub N: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_RTCFilterFunctionNArguments() {
    assert_eq!(
        ::std::mem::size_of::<RTCFilterFunctionNArguments>(),
        48usize,
        concat!("Size of: ", stringify!(RTCFilterFunctionNArguments))
    );
    assert_eq!(
        ::std::mem::align_of::<RTCFilterFunctionNArguments>(),
        8usize,
        concat!("Alignment of ", stringify!(RTCFilterFunctionNArguments))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RTCFilterFunctionNArguments>())).valid as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCFilterFunctionNArguments),
            "::",
            stringify!(valid)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RTCFilterFunctionNArguments>())).geometryUserPtr as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCFilterFunctionNArguments),
            "::",
            stringify!(geometryUserPtr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RTCFilterFunctionNArguments>())).context as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCFilterFunctionNArguments),
            "::",
            stringify!(context)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCFilterFunctionNArguments>())).ray as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCFilterFunctionNArguments),
            "::",
            stringify!(ray)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCFilterFunctionNArguments>())).hit as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCFilterFunctionNArguments),
            "::",
            stringify!(hit)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCFilterFunctionNArguments>())).N as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCFilterFunctionNArguments),
            "::",
            stringify!(N)
        )
    );
}
pub type RTCFilterFunctionN =
    ::std::option::Option<unsafe extern "C" fn(args: *const RTCFilterFunctionNArguments)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RTCIntersectContext {
    pub flags: RTCIntersectContextFlags,
    pub filter: RTCFilterFunctionN,
    pub instID: [::std::os::raw::c_uint; 1usize],
}
#[test]
fn bindgen_test_layout_RTCIntersectContext() {
    assert_eq!(
        ::std::mem::size_of::<RTCIntersectContext>(),
        24usize,
        concat!("Size of: ", stringify!(RTCIntersectContext))
    );
    assert_eq!(
        ::std::mem::align_of::<RTCIntersectContext>(),
        8usize,
        concat!("Alignment of ", stringify!(RTCIntersectContext))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCIntersectContext>())).flags as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCIntersectContext),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCIntersectContext>())).filter as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCIntersectContext),
            "::",
            stringify!(filter)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCIntersectContext>())).instID as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCIntersectContext),
            "::",
            stringify!(instID)
        )
    );
}
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct RTCPointQuery {
    pub x: f32,
    pub y: f32,
    pub z: f32,
    pub time: f32,
    pub radius: f32,
}
#[test]
fn bindgen_test_layout_RTCPointQuery() {
    assert_eq!(
        ::std::mem::size_of::<RTCPointQuery>(),
        32usize,
        concat!("Size of: ", stringify!(RTCPointQuery))
    );
    assert_eq!(
        ::std::mem::align_of::<RTCPointQuery>(),
        16usize,
        concat!("Alignment of ", stringify!(RTCPointQuery))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCPointQuery>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCPointQuery),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCPointQuery>())).y as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCPointQuery),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCPointQuery>())).z as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCPointQuery),
            "::",
            stringify!(z)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCPointQuery>())).time as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCPointQuery),
            "::",
            stringify!(time)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCPointQuery>())).radius as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCPointQuery),
            "::",
            stringify!(radius)
        )
    );
}
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct RTCPointQuery4 {
    pub x: [f32; 4usize],
    pub y: [f32; 4usize],
    pub z: [f32; 4usize],
    pub time: [f32; 4usize],
    pub radius: [f32; 4usize],
}
#[test]
fn bindgen_test_layout_RTCPointQuery4() {
    assert_eq!(
        ::std::mem::size_of::<RTCPointQuery4>(),
        80usize,
        concat!("Size of: ", stringify!(RTCPointQuery4))
    );
    assert_eq!(
        ::std::mem::align_of::<RTCPointQuery4>(),
        16usize,
        concat!("Alignment of ", stringify!(RTCPointQuery4))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCPointQuery4>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCPointQuery4),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCPointQuery4>())).y as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCPointQuery4),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCPointQuery4>())).z as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCPointQuery4),
            "::",
            stringify!(z)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCPointQuery4>())).time as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCPointQuery4),
            "::",
            stringify!(time)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCPointQuery4>())).radius as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCPointQuery4),
            "::",
            stringify!(radius)
        )
    );
}
#[repr(C)]
#[repr(align(32))]
#[derive(Debug, Copy, Clone)]
pub struct RTCPointQuery8 {
    pub x: [f32; 8usize],
    pub y: [f32; 8usize],
    pub z: [f32; 8usize],
    pub time: [f32; 8usize],
    pub radius: [f32; 8usize],
}
#[test]
fn bindgen_test_layout_RTCPointQuery8() {
    assert_eq!(
        ::std::mem::size_of::<RTCPointQuery8>(),
        160usize,
        concat!("Size of: ", stringify!(RTCPointQuery8))
    );
    assert_eq!(
        ::std::mem::align_of::<RTCPointQuery8>(),
        32usize,
        concat!("Alignment of ", stringify!(RTCPointQuery8))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCPointQuery8>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCPointQuery8),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCPointQuery8>())).y as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCPointQuery8),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCPointQuery8>())).z as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCPointQuery8),
            "::",
            stringify!(z)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCPointQuery8>())).time as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCPointQuery8),
            "::",
            stringify!(time)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCPointQuery8>())).radius as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCPointQuery8),
            "::",
            stringify!(radius)
        )
    );
}
#[repr(C)]
#[repr(align(64))]
#[derive(Debug, Copy, Clone)]
pub struct RTCPointQuery16 {
    pub x: [f32; 16usize],
    pub y: [f32; 16usize],
    pub z: [f32; 16usize],
    pub time: [f32; 16usize],
    pub radius: [f32; 16usize],
}
#[test]
fn bindgen_test_layout_RTCPointQuery16() {
    assert_eq!(
        ::std::mem::size_of::<RTCPointQuery16>(),
        320usize,
        concat!("Size of: ", stringify!(RTCPointQuery16))
    );
    assert_eq!(
        ::std::mem::align_of::<RTCPointQuery16>(),
        64usize,
        concat!("Alignment of ", stringify!(RTCPointQuery16))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCPointQuery16>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCPointQuery16),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCPointQuery16>())).y as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCPointQuery16),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCPointQuery16>())).z as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCPointQuery16),
            "::",
            stringify!(z)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCPointQuery16>())).time as *const _ as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCPointQuery16),
            "::",
            stringify!(time)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCPointQuery16>())).radius as *const _ as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCPointQuery16),
            "::",
            stringify!(radius)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RTCPointQueryN {
    _unused: [u8; 0],
}
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct RTCPointQueryContext {
    pub world2inst: [[f32; 16usize]; 1usize],
    pub inst2world: [[f32; 16usize]; 1usize],
    pub instID: [::std::os::raw::c_uint; 1usize],
    pub instStackSize: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_RTCPointQueryContext() {
    assert_eq!(
        ::std::mem::size_of::<RTCPointQueryContext>(),
        144usize,
        concat!("Size of: ", stringify!(RTCPointQueryContext))
    );
    assert_eq!(
        ::std::mem::align_of::<RTCPointQueryContext>(),
        16usize,
        concat!("Alignment of ", stringify!(RTCPointQueryContext))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCPointQueryContext>())).world2inst as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCPointQueryContext),
            "::",
            stringify!(world2inst)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCPointQueryContext>())).inst2world as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCPointQueryContext),
            "::",
            stringify!(inst2world)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCPointQueryContext>())).instID as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCPointQueryContext),
            "::",
            stringify!(instID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RTCPointQueryContext>())).instStackSize as *const _ as usize
        },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCPointQueryContext),
            "::",
            stringify!(instStackSize)
        )
    );
}
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct RTCPointQueryFunctionArguments {
    pub query: *mut RTCPointQuery,
    pub userPtr: *mut ::std::os::raw::c_void,
    pub primID: ::std::os::raw::c_uint,
    pub geomID: ::std::os::raw::c_uint,
    pub context: *mut RTCPointQueryContext,
    pub similarityScale: f32,
}
#[test]
fn bindgen_test_layout_RTCPointQueryFunctionArguments() {
    assert_eq!(
        ::std::mem::size_of::<RTCPointQueryFunctionArguments>(),
        48usize,
        concat!("Size of: ", stringify!(RTCPointQueryFunctionArguments))
    );
    assert_eq!(
        ::std::mem::align_of::<RTCPointQueryFunctionArguments>(),
        16usize,
        concat!("Alignment of ", stringify!(RTCPointQueryFunctionArguments))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RTCPointQueryFunctionArguments>())).query as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCPointQueryFunctionArguments),
            "::",
            stringify!(query)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RTCPointQueryFunctionArguments>())).userPtr as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCPointQueryFunctionArguments),
            "::",
            stringify!(userPtr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RTCPointQueryFunctionArguments>())).primID as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCPointQueryFunctionArguments),
            "::",
            stringify!(primID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RTCPointQueryFunctionArguments>())).geomID as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCPointQueryFunctionArguments),
            "::",
            stringify!(geomID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RTCPointQueryFunctionArguments>())).context as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCPointQueryFunctionArguments),
            "::",
            stringify!(context)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RTCPointQueryFunctionArguments>())).similarityScale as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCPointQueryFunctionArguments),
            "::",
            stringify!(similarityScale)
        )
    );
}
pub type RTCPointQueryFunction =
    ::std::option::Option<unsafe extern "C" fn(args: *mut RTCPointQueryFunctionArguments) -> bool>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RTCDeviceTy {
    _unused: [u8; 0],
}
pub type RTCDevice = *mut RTCDeviceTy;
extern "C" {
    pub fn rtcNewDevice(config: *const ::std::os::raw::c_char) -> RTCDevice;
}
extern "C" {
    pub fn rtcRetainDevice(device: RTCDevice);
}
extern "C" {
    pub fn rtcReleaseDevice(device: RTCDevice);
}
pub const RTCDeviceProperty_RTC_DEVICE_PROPERTY_VERSION: RTCDeviceProperty = 0;
pub const RTCDeviceProperty_RTC_DEVICE_PROPERTY_VERSION_MAJOR: RTCDeviceProperty = 1;
pub const RTCDeviceProperty_RTC_DEVICE_PROPERTY_VERSION_MINOR: RTCDeviceProperty = 2;
pub const RTCDeviceProperty_RTC_DEVICE_PROPERTY_VERSION_PATCH: RTCDeviceProperty = 3;
pub const RTCDeviceProperty_RTC_DEVICE_PROPERTY_NATIVE_RAY4_SUPPORTED: RTCDeviceProperty = 32;
pub const RTCDeviceProperty_RTC_DEVICE_PROPERTY_NATIVE_RAY8_SUPPORTED: RTCDeviceProperty = 33;
pub const RTCDeviceProperty_RTC_DEVICE_PROPERTY_NATIVE_RAY16_SUPPORTED: RTCDeviceProperty = 34;
pub const RTCDeviceProperty_RTC_DEVICE_PROPERTY_RAY_STREAM_SUPPORTED: RTCDeviceProperty = 35;
pub const RTCDeviceProperty_RTC_DEVICE_PROPERTY_BACKFACE_CULLING_CURVES_ENABLED: RTCDeviceProperty =
    63;
pub const RTCDeviceProperty_RTC_DEVICE_PROPERTY_RAY_MASK_SUPPORTED: RTCDeviceProperty = 64;
pub const RTCDeviceProperty_RTC_DEVICE_PROPERTY_BACKFACE_CULLING_ENABLED: RTCDeviceProperty = 65;
pub const RTCDeviceProperty_RTC_DEVICE_PROPERTY_FILTER_FUNCTION_SUPPORTED: RTCDeviceProperty = 66;
pub const RTCDeviceProperty_RTC_DEVICE_PROPERTY_IGNORE_INVALID_RAYS_ENABLED: RTCDeviceProperty = 67;
pub const RTCDeviceProperty_RTC_DEVICE_PROPERTY_COMPACT_POLYS_ENABLED: RTCDeviceProperty = 68;
pub const RTCDeviceProperty_RTC_DEVICE_PROPERTY_TRIANGLE_GEOMETRY_SUPPORTED: RTCDeviceProperty = 96;
pub const RTCDeviceProperty_RTC_DEVICE_PROPERTY_QUAD_GEOMETRY_SUPPORTED: RTCDeviceProperty = 97;
pub const RTCDeviceProperty_RTC_DEVICE_PROPERTY_SUBDIVISION_GEOMETRY_SUPPORTED: RTCDeviceProperty =
    98;
pub const RTCDeviceProperty_RTC_DEVICE_PROPERTY_CURVE_GEOMETRY_SUPPORTED: RTCDeviceProperty = 99;
pub const RTCDeviceProperty_RTC_DEVICE_PROPERTY_USER_GEOMETRY_SUPPORTED: RTCDeviceProperty = 100;
pub const RTCDeviceProperty_RTC_DEVICE_PROPERTY_POINT_GEOMETRY_SUPPORTED: RTCDeviceProperty = 101;
pub const RTCDeviceProperty_RTC_DEVICE_PROPERTY_TASKING_SYSTEM: RTCDeviceProperty = 128;
pub const RTCDeviceProperty_RTC_DEVICE_PROPERTY_JOIN_COMMIT_SUPPORTED: RTCDeviceProperty = 129;
pub const RTCDeviceProperty_RTC_DEVICE_PROPERTY_PARALLEL_COMMIT_SUPPORTED: RTCDeviceProperty = 130;
pub type RTCDeviceProperty = ::std::os::raw::c_int;
extern "C" {
    pub fn rtcGetDeviceProperty(device: RTCDevice, prop: RTCDeviceProperty) -> ssize_t;
}
extern "C" {
    pub fn rtcSetDeviceProperty(device: RTCDevice, prop: RTCDeviceProperty, value: ssize_t);
}
pub const RTCError_RTC_ERROR_NONE: RTCError = 0;
pub const RTCError_RTC_ERROR_UNKNOWN: RTCError = 1;
pub const RTCError_RTC_ERROR_INVALID_ARGUMENT: RTCError = 2;
pub const RTCError_RTC_ERROR_INVALID_OPERATION: RTCError = 3;
pub const RTCError_RTC_ERROR_OUT_OF_MEMORY: RTCError = 4;
pub const RTCError_RTC_ERROR_UNSUPPORTED_CPU: RTCError = 5;
pub const RTCError_RTC_ERROR_CANCELLED: RTCError = 6;
pub type RTCError = ::std::os::raw::c_int;
extern "C" {
    pub fn rtcGetDeviceError(device: RTCDevice) -> RTCError;
}
pub type RTCErrorFunction = ::std::option::Option<
    unsafe extern "C" fn(
        userPtr: *mut ::std::os::raw::c_void,
        code: RTCError,
        str_: *const ::std::os::raw::c_char,
    ),
>;
extern "C" {
    pub fn rtcSetDeviceErrorFunction(
        device: RTCDevice,
        error: RTCErrorFunction,
        userPtr: *mut ::std::os::raw::c_void,
    );
}
pub type RTCMemoryMonitorFunction = ::std::option::Option<
    unsafe extern "C" fn(ptr: *mut ::std::os::raw::c_void, bytes: ssize_t, post: bool) -> bool,
>;
extern "C" {
    pub fn rtcSetDeviceMemoryMonitorFunction(
        device: RTCDevice,
        memoryMonitor: RTCMemoryMonitorFunction,
        userPtr: *mut ::std::os::raw::c_void,
    );
}
pub const RTCBufferType_RTC_BUFFER_TYPE_INDEX: RTCBufferType = 0;
pub const RTCBufferType_RTC_BUFFER_TYPE_VERTEX: RTCBufferType = 1;
pub const RTCBufferType_RTC_BUFFER_TYPE_VERTEX_ATTRIBUTE: RTCBufferType = 2;
pub const RTCBufferType_RTC_BUFFER_TYPE_NORMAL: RTCBufferType = 3;
pub const RTCBufferType_RTC_BUFFER_TYPE_TANGENT: RTCBufferType = 4;
pub const RTCBufferType_RTC_BUFFER_TYPE_NORMAL_DERIVATIVE: RTCBufferType = 5;
pub const RTCBufferType_RTC_BUFFER_TYPE_GRID: RTCBufferType = 8;
pub const RTCBufferType_RTC_BUFFER_TYPE_FACE: RTCBufferType = 16;
pub const RTCBufferType_RTC_BUFFER_TYPE_LEVEL: RTCBufferType = 17;
pub const RTCBufferType_RTC_BUFFER_TYPE_EDGE_CREASE_INDEX: RTCBufferType = 18;
pub const RTCBufferType_RTC_BUFFER_TYPE_EDGE_CREASE_WEIGHT: RTCBufferType = 19;
pub const RTCBufferType_RTC_BUFFER_TYPE_VERTEX_CREASE_INDEX: RTCBufferType = 20;
pub const RTCBufferType_RTC_BUFFER_TYPE_VERTEX_CREASE_WEIGHT: RTCBufferType = 21;
pub const RTCBufferType_RTC_BUFFER_TYPE_HOLE: RTCBufferType = 22;
pub const RTCBufferType_RTC_BUFFER_TYPE_FLAGS: RTCBufferType = 32;
pub type RTCBufferType = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RTCBufferTy {
    _unused: [u8; 0],
}
pub type RTCBuffer = *mut RTCBufferTy;
extern "C" {
    pub fn rtcNewBuffer(device: RTCDevice, byteSize: size_t) -> RTCBuffer;
}
extern "C" {
    pub fn rtcNewSharedBuffer(
        device: RTCDevice,
        ptr: *mut ::std::os::raw::c_void,
        byteSize: size_t,
    ) -> RTCBuffer;
}
extern "C" {
    pub fn rtcGetBufferData(buffer: RTCBuffer) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn rtcRetainBuffer(buffer: RTCBuffer);
}
extern "C" {
    pub fn rtcReleaseBuffer(buffer: RTCBuffer);
}
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct RTCRay {
    pub org_x: f32,
    pub org_y: f32,
    pub org_z: f32,
    pub tnear: f32,
    pub dir_x: f32,
    pub dir_y: f32,
    pub dir_z: f32,
    pub time: f32,
    pub tfar: f32,
    pub mask: ::std::os::raw::c_uint,
    pub id: ::std::os::raw::c_uint,
    pub flags: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_RTCRay() {
    assert_eq!(
        ::std::mem::size_of::<RTCRay>(),
        48usize,
        concat!("Size of: ", stringify!(RTCRay))
    );
    assert_eq!(
        ::std::mem::align_of::<RTCRay>(),
        16usize,
        concat!("Alignment of ", stringify!(RTCRay))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCRay>())).org_x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCRay),
            "::",
            stringify!(org_x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCRay>())).org_y as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCRay),
            "::",
            stringify!(org_y)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCRay>())).org_z as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCRay),
            "::",
            stringify!(org_z)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCRay>())).tnear as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCRay),
            "::",
            stringify!(tnear)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCRay>())).dir_x as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCRay),
            "::",
            stringify!(dir_x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCRay>())).dir_y as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCRay),
            "::",
            stringify!(dir_y)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCRay>())).dir_z as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCRay),
            "::",
            stringify!(dir_z)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCRay>())).time as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCRay),
            "::",
            stringify!(time)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCRay>())).tfar as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCRay),
            "::",
            stringify!(tfar)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCRay>())).mask as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCRay),
            "::",
            stringify!(mask)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCRay>())).id as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCRay),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCRay>())).flags as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCRay),
            "::",
            stringify!(flags)
        )
    );
}
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct RTCHit {
    pub Ng_x: f32,
    pub Ng_y: f32,
    pub Ng_z: f32,
    pub u: f32,
    pub v: f32,
    pub primID: ::std::os::raw::c_uint,
    pub geomID: ::std::os::raw::c_uint,
    pub instID: [::std::os::raw::c_uint; 1usize],
}
#[test]
fn bindgen_test_layout_RTCHit() {
    assert_eq!(
        ::std::mem::size_of::<RTCHit>(),
        32usize,
        concat!("Size of: ", stringify!(RTCHit))
    );
    assert_eq!(
        ::std::mem::align_of::<RTCHit>(),
        16usize,
        concat!("Alignment of ", stringify!(RTCHit))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCHit>())).Ng_x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCHit),
            "::",
            stringify!(Ng_x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCHit>())).Ng_y as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCHit),
            "::",
            stringify!(Ng_y)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCHit>())).Ng_z as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCHit),
            "::",
            stringify!(Ng_z)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCHit>())).u as *const _ as usize },
        12usize,
        concat!("Offset of field: ", stringify!(RTCHit), "::", stringify!(u))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCHit>())).v as *const _ as usize },
        16usize,
        concat!("Offset of field: ", stringify!(RTCHit), "::", stringify!(v))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCHit>())).primID as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCHit),
            "::",
            stringify!(primID)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCHit>())).geomID as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCHit),
            "::",
            stringify!(geomID)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCHit>())).instID as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCHit),
            "::",
            stringify!(instID)
        )
    );
}
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct RTCRayHit {
    pub ray: RTCRay,
    pub hit: RTCHit,
}
#[test]
fn bindgen_test_layout_RTCRayHit() {
    assert_eq!(
        ::std::mem::size_of::<RTCRayHit>(),
        80usize,
        concat!("Size of: ", stringify!(RTCRayHit))
    );
    assert_eq!(
        ::std::mem::align_of::<RTCRayHit>(),
        16usize,
        concat!("Alignment of ", stringify!(RTCRayHit))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCRayHit>())).ray as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCRayHit),
            "::",
            stringify!(ray)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCRayHit>())).hit as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCRayHit),
            "::",
            stringify!(hit)
        )
    );
}
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct RTCRay4 {
    pub org_x: [f32; 4usize],
    pub org_y: [f32; 4usize],
    pub org_z: [f32; 4usize],
    pub tnear: [f32; 4usize],
    pub dir_x: [f32; 4usize],
    pub dir_y: [f32; 4usize],
    pub dir_z: [f32; 4usize],
    pub time: [f32; 4usize],
    pub tfar: [f32; 4usize],
    pub mask: [::std::os::raw::c_uint; 4usize],
    pub id: [::std::os::raw::c_uint; 4usize],
    pub flags: [::std::os::raw::c_uint; 4usize],
}
#[test]
fn bindgen_test_layout_RTCRay4() {
    assert_eq!(
        ::std::mem::size_of::<RTCRay4>(),
        192usize,
        concat!("Size of: ", stringify!(RTCRay4))
    );
    assert_eq!(
        ::std::mem::align_of::<RTCRay4>(),
        16usize,
        concat!("Alignment of ", stringify!(RTCRay4))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCRay4>())).org_x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCRay4),
            "::",
            stringify!(org_x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCRay4>())).org_y as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCRay4),
            "::",
            stringify!(org_y)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCRay4>())).org_z as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCRay4),
            "::",
            stringify!(org_z)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCRay4>())).tnear as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCRay4),
            "::",
            stringify!(tnear)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCRay4>())).dir_x as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCRay4),
            "::",
            stringify!(dir_x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCRay4>())).dir_y as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCRay4),
            "::",
            stringify!(dir_y)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCRay4>())).dir_z as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCRay4),
            "::",
            stringify!(dir_z)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCRay4>())).time as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCRay4),
            "::",
            stringify!(time)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCRay4>())).tfar as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCRay4),
            "::",
            stringify!(tfar)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCRay4>())).mask as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCRay4),
            "::",
            stringify!(mask)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCRay4>())).id as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCRay4),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCRay4>())).flags as *const _ as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCRay4),
            "::",
            stringify!(flags)
        )
    );
}
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct RTCHit4 {
    pub Ng_x: [f32; 4usize],
    pub Ng_y: [f32; 4usize],
    pub Ng_z: [f32; 4usize],
    pub u: [f32; 4usize],
    pub v: [f32; 4usize],
    pub primID: [::std::os::raw::c_uint; 4usize],
    pub geomID: [::std::os::raw::c_uint; 4usize],
    pub instID: [[::std::os::raw::c_uint; 4usize]; 1usize],
}
#[test]
fn bindgen_test_layout_RTCHit4() {
    assert_eq!(
        ::std::mem::size_of::<RTCHit4>(),
        128usize,
        concat!("Size of: ", stringify!(RTCHit4))
    );
    assert_eq!(
        ::std::mem::align_of::<RTCHit4>(),
        16usize,
        concat!("Alignment of ", stringify!(RTCHit4))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCHit4>())).Ng_x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCHit4),
            "::",
            stringify!(Ng_x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCHit4>())).Ng_y as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCHit4),
            "::",
            stringify!(Ng_y)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCHit4>())).Ng_z as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCHit4),
            "::",
            stringify!(Ng_z)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCHit4>())).u as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCHit4),
            "::",
            stringify!(u)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCHit4>())).v as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCHit4),
            "::",
            stringify!(v)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCHit4>())).primID as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCHit4),
            "::",
            stringify!(primID)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCHit4>())).geomID as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCHit4),
            "::",
            stringify!(geomID)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCHit4>())).instID as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCHit4),
            "::",
            stringify!(instID)
        )
    );
}
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct RTCRayHit4 {
    pub ray: RTCRay4,
    pub hit: RTCHit4,
}
#[test]
fn bindgen_test_layout_RTCRayHit4() {
    assert_eq!(
        ::std::mem::size_of::<RTCRayHit4>(),
        320usize,
        concat!("Size of: ", stringify!(RTCRayHit4))
    );
    assert_eq!(
        ::std::mem::align_of::<RTCRayHit4>(),
        16usize,
        concat!("Alignment of ", stringify!(RTCRayHit4))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCRayHit4>())).ray as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCRayHit4),
            "::",
            stringify!(ray)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCRayHit4>())).hit as *const _ as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCRayHit4),
            "::",
            stringify!(hit)
        )
    );
}
#[repr(C)]
#[repr(align(32))]
#[derive(Debug, Copy, Clone)]
pub struct RTCRay8 {
    pub org_x: [f32; 8usize],
    pub org_y: [f32; 8usize],
    pub org_z: [f32; 8usize],
    pub tnear: [f32; 8usize],
    pub dir_x: [f32; 8usize],
    pub dir_y: [f32; 8usize],
    pub dir_z: [f32; 8usize],
    pub time: [f32; 8usize],
    pub tfar: [f32; 8usize],
    pub mask: [::std::os::raw::c_uint; 8usize],
    pub id: [::std::os::raw::c_uint; 8usize],
    pub flags: [::std::os::raw::c_uint; 8usize],
}
#[test]
fn bindgen_test_layout_RTCRay8() {
    assert_eq!(
        ::std::mem::size_of::<RTCRay8>(),
        384usize,
        concat!("Size of: ", stringify!(RTCRay8))
    );
    assert_eq!(
        ::std::mem::align_of::<RTCRay8>(),
        32usize,
        concat!("Alignment of ", stringify!(RTCRay8))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCRay8>())).org_x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCRay8),
            "::",
            stringify!(org_x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCRay8>())).org_y as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCRay8),
            "::",
            stringify!(org_y)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCRay8>())).org_z as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCRay8),
            "::",
            stringify!(org_z)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCRay8>())).tnear as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCRay8),
            "::",
            stringify!(tnear)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCRay8>())).dir_x as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCRay8),
            "::",
            stringify!(dir_x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCRay8>())).dir_y as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCRay8),
            "::",
            stringify!(dir_y)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCRay8>())).dir_z as *const _ as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCRay8),
            "::",
            stringify!(dir_z)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCRay8>())).time as *const _ as usize },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCRay8),
            "::",
            stringify!(time)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCRay8>())).tfar as *const _ as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCRay8),
            "::",
            stringify!(tfar)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCRay8>())).mask as *const _ as usize },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCRay8),
            "::",
            stringify!(mask)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCRay8>())).id as *const _ as usize },
        320usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCRay8),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCRay8>())).flags as *const _ as usize },
        352usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCRay8),
            "::",
            stringify!(flags)
        )
    );
}
#[repr(C)]
#[repr(align(32))]
#[derive(Debug, Copy, Clone)]
pub struct RTCHit8 {
    pub Ng_x: [f32; 8usize],
    pub Ng_y: [f32; 8usize],
    pub Ng_z: [f32; 8usize],
    pub u: [f32; 8usize],
    pub v: [f32; 8usize],
    pub primID: [::std::os::raw::c_uint; 8usize],
    pub geomID: [::std::os::raw::c_uint; 8usize],
    pub instID: [[::std::os::raw::c_uint; 8usize]; 1usize],
}
#[test]
fn bindgen_test_layout_RTCHit8() {
    assert_eq!(
        ::std::mem::size_of::<RTCHit8>(),
        256usize,
        concat!("Size of: ", stringify!(RTCHit8))
    );
    assert_eq!(
        ::std::mem::align_of::<RTCHit8>(),
        32usize,
        concat!("Alignment of ", stringify!(RTCHit8))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCHit8>())).Ng_x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCHit8),
            "::",
            stringify!(Ng_x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCHit8>())).Ng_y as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCHit8),
            "::",
            stringify!(Ng_y)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCHit8>())).Ng_z as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCHit8),
            "::",
            stringify!(Ng_z)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCHit8>())).u as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCHit8),
            "::",
            stringify!(u)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCHit8>())).v as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCHit8),
            "::",
            stringify!(v)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCHit8>())).primID as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCHit8),
            "::",
            stringify!(primID)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCHit8>())).geomID as *const _ as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCHit8),
            "::",
            stringify!(geomID)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCHit8>())).instID as *const _ as usize },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCHit8),
            "::",
            stringify!(instID)
        )
    );
}
#[repr(C)]
#[repr(align(32))]
#[derive(Debug, Copy, Clone)]
pub struct RTCRayHit8 {
    pub ray: RTCRay8,
    pub hit: RTCHit8,
}
#[test]
fn bindgen_test_layout_RTCRayHit8() {
    assert_eq!(
        ::std::mem::size_of::<RTCRayHit8>(),
        640usize,
        concat!("Size of: ", stringify!(RTCRayHit8))
    );
    assert_eq!(
        ::std::mem::align_of::<RTCRayHit8>(),
        32usize,
        concat!("Alignment of ", stringify!(RTCRayHit8))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCRayHit8>())).ray as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCRayHit8),
            "::",
            stringify!(ray)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCRayHit8>())).hit as *const _ as usize },
        384usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCRayHit8),
            "::",
            stringify!(hit)
        )
    );
}
#[repr(C)]
#[repr(align(64))]
#[derive(Debug, Copy, Clone)]
pub struct RTCRay16 {
    pub org_x: [f32; 16usize],
    pub org_y: [f32; 16usize],
    pub org_z: [f32; 16usize],
    pub tnear: [f32; 16usize],
    pub dir_x: [f32; 16usize],
    pub dir_y: [f32; 16usize],
    pub dir_z: [f32; 16usize],
    pub time: [f32; 16usize],
    pub tfar: [f32; 16usize],
    pub mask: [::std::os::raw::c_uint; 16usize],
    pub id: [::std::os::raw::c_uint; 16usize],
    pub flags: [::std::os::raw::c_uint; 16usize],
}
#[test]
fn bindgen_test_layout_RTCRay16() {
    assert_eq!(
        ::std::mem::size_of::<RTCRay16>(),
        768usize,
        concat!("Size of: ", stringify!(RTCRay16))
    );
    assert_eq!(
        ::std::mem::align_of::<RTCRay16>(),
        64usize,
        concat!("Alignment of ", stringify!(RTCRay16))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCRay16>())).org_x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCRay16),
            "::",
            stringify!(org_x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCRay16>())).org_y as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCRay16),
            "::",
            stringify!(org_y)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCRay16>())).org_z as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCRay16),
            "::",
            stringify!(org_z)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCRay16>())).tnear as *const _ as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCRay16),
            "::",
            stringify!(tnear)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCRay16>())).dir_x as *const _ as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCRay16),
            "::",
            stringify!(dir_x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCRay16>())).dir_y as *const _ as usize },
        320usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCRay16),
            "::",
            stringify!(dir_y)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCRay16>())).dir_z as *const _ as usize },
        384usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCRay16),
            "::",
            stringify!(dir_z)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCRay16>())).time as *const _ as usize },
        448usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCRay16),
            "::",
            stringify!(time)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCRay16>())).tfar as *const _ as usize },
        512usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCRay16),
            "::",
            stringify!(tfar)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCRay16>())).mask as *const _ as usize },
        576usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCRay16),
            "::",
            stringify!(mask)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCRay16>())).id as *const _ as usize },
        640usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCRay16),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCRay16>())).flags as *const _ as usize },
        704usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCRay16),
            "::",
            stringify!(flags)
        )
    );
}
#[repr(C)]
#[repr(align(64))]
#[derive(Debug, Copy, Clone)]
pub struct RTCHit16 {
    pub Ng_x: [f32; 16usize],
    pub Ng_y: [f32; 16usize],
    pub Ng_z: [f32; 16usize],
    pub u: [f32; 16usize],
    pub v: [f32; 16usize],
    pub primID: [::std::os::raw::c_uint; 16usize],
    pub geomID: [::std::os::raw::c_uint; 16usize],
    pub instID: [[::std::os::raw::c_uint; 16usize]; 1usize],
}
#[test]
fn bindgen_test_layout_RTCHit16() {
    assert_eq!(
        ::std::mem::size_of::<RTCHit16>(),
        512usize,
        concat!("Size of: ", stringify!(RTCHit16))
    );
    assert_eq!(
        ::std::mem::align_of::<RTCHit16>(),
        64usize,
        concat!("Alignment of ", stringify!(RTCHit16))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCHit16>())).Ng_x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCHit16),
            "::",
            stringify!(Ng_x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCHit16>())).Ng_y as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCHit16),
            "::",
            stringify!(Ng_y)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCHit16>())).Ng_z as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCHit16),
            "::",
            stringify!(Ng_z)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCHit16>())).u as *const _ as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCHit16),
            "::",
            stringify!(u)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCHit16>())).v as *const _ as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCHit16),
            "::",
            stringify!(v)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCHit16>())).primID as *const _ as usize },
        320usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCHit16),
            "::",
            stringify!(primID)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCHit16>())).geomID as *const _ as usize },
        384usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCHit16),
            "::",
            stringify!(geomID)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCHit16>())).instID as *const _ as usize },
        448usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCHit16),
            "::",
            stringify!(instID)
        )
    );
}
#[repr(C)]
#[repr(align(64))]
#[derive(Debug, Copy, Clone)]
pub struct RTCRayHit16 {
    pub ray: RTCRay16,
    pub hit: RTCHit16,
}
#[test]
fn bindgen_test_layout_RTCRayHit16() {
    assert_eq!(
        ::std::mem::size_of::<RTCRayHit16>(),
        1280usize,
        concat!("Size of: ", stringify!(RTCRayHit16))
    );
    assert_eq!(
        ::std::mem::align_of::<RTCRayHit16>(),
        64usize,
        concat!("Alignment of ", stringify!(RTCRayHit16))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCRayHit16>())).ray as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCRayHit16),
            "::",
            stringify!(ray)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCRayHit16>())).hit as *const _ as usize },
        768usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCRayHit16),
            "::",
            stringify!(hit)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RTCRayNp {
    pub org_x: *mut f32,
    pub org_y: *mut f32,
    pub org_z: *mut f32,
    pub tnear: *mut f32,
    pub dir_x: *mut f32,
    pub dir_y: *mut f32,
    pub dir_z: *mut f32,
    pub time: *mut f32,
    pub tfar: *mut f32,
    pub mask: *mut ::std::os::raw::c_uint,
    pub id: *mut ::std::os::raw::c_uint,
    pub flags: *mut ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_RTCRayNp() {
    assert_eq!(
        ::std::mem::size_of::<RTCRayNp>(),
        96usize,
        concat!("Size of: ", stringify!(RTCRayNp))
    );
    assert_eq!(
        ::std::mem::align_of::<RTCRayNp>(),
        8usize,
        concat!("Alignment of ", stringify!(RTCRayNp))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCRayNp>())).org_x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCRayNp),
            "::",
            stringify!(org_x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCRayNp>())).org_y as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCRayNp),
            "::",
            stringify!(org_y)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCRayNp>())).org_z as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCRayNp),
            "::",
            stringify!(org_z)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCRayNp>())).tnear as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCRayNp),
            "::",
            stringify!(tnear)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCRayNp>())).dir_x as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCRayNp),
            "::",
            stringify!(dir_x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCRayNp>())).dir_y as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCRayNp),
            "::",
            stringify!(dir_y)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCRayNp>())).dir_z as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCRayNp),
            "::",
            stringify!(dir_z)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCRayNp>())).time as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCRayNp),
            "::",
            stringify!(time)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCRayNp>())).tfar as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCRayNp),
            "::",
            stringify!(tfar)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCRayNp>())).mask as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCRayNp),
            "::",
            stringify!(mask)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCRayNp>())).id as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCRayNp),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCRayNp>())).flags as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCRayNp),
            "::",
            stringify!(flags)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RTCHitNp {
    pub Ng_x: *mut f32,
    pub Ng_y: *mut f32,
    pub Ng_z: *mut f32,
    pub u: *mut f32,
    pub v: *mut f32,
    pub primID: *mut ::std::os::raw::c_uint,
    pub geomID: *mut ::std::os::raw::c_uint,
    pub instID: [*mut ::std::os::raw::c_uint; 1usize],
}
#[test]
fn bindgen_test_layout_RTCHitNp() {
    assert_eq!(
        ::std::mem::size_of::<RTCHitNp>(),
        64usize,
        concat!("Size of: ", stringify!(RTCHitNp))
    );
    assert_eq!(
        ::std::mem::align_of::<RTCHitNp>(),
        8usize,
        concat!("Alignment of ", stringify!(RTCHitNp))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCHitNp>())).Ng_x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCHitNp),
            "::",
            stringify!(Ng_x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCHitNp>())).Ng_y as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCHitNp),
            "::",
            stringify!(Ng_y)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCHitNp>())).Ng_z as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCHitNp),
            "::",
            stringify!(Ng_z)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCHitNp>())).u as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCHitNp),
            "::",
            stringify!(u)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCHitNp>())).v as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCHitNp),
            "::",
            stringify!(v)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCHitNp>())).primID as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCHitNp),
            "::",
            stringify!(primID)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCHitNp>())).geomID as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCHitNp),
            "::",
            stringify!(geomID)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCHitNp>())).instID as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCHitNp),
            "::",
            stringify!(instID)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RTCRayHitNp {
    pub ray: RTCRayNp,
    pub hit: RTCHitNp,
}
#[test]
fn bindgen_test_layout_RTCRayHitNp() {
    assert_eq!(
        ::std::mem::size_of::<RTCRayHitNp>(),
        160usize,
        concat!("Size of: ", stringify!(RTCRayHitNp))
    );
    assert_eq!(
        ::std::mem::align_of::<RTCRayHitNp>(),
        8usize,
        concat!("Alignment of ", stringify!(RTCRayHitNp))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCRayHitNp>())).ray as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCRayHitNp),
            "::",
            stringify!(ray)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCRayHitNp>())).hit as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCRayHitNp),
            "::",
            stringify!(hit)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RTCRayN {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RTCHitN {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RTCRayHitN {
    _unused: [u8; 0],
}
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct RTCQuaternionDecomposition {
    pub scale_x: f32,
    pub scale_y: f32,
    pub scale_z: f32,
    pub skew_xy: f32,
    pub skew_xz: f32,
    pub skew_yz: f32,
    pub shift_x: f32,
    pub shift_y: f32,
    pub shift_z: f32,
    pub quaternion_r: f32,
    pub quaternion_i: f32,
    pub quaternion_j: f32,
    pub quaternion_k: f32,
    pub translation_x: f32,
    pub translation_y: f32,
    pub translation_z: f32,
}
#[test]
fn bindgen_test_layout_RTCQuaternionDecomposition() {
    assert_eq!(
        ::std::mem::size_of::<RTCQuaternionDecomposition>(),
        64usize,
        concat!("Size of: ", stringify!(RTCQuaternionDecomposition))
    );
    assert_eq!(
        ::std::mem::align_of::<RTCQuaternionDecomposition>(),
        16usize,
        concat!("Alignment of ", stringify!(RTCQuaternionDecomposition))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RTCQuaternionDecomposition>())).scale_x as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCQuaternionDecomposition),
            "::",
            stringify!(scale_x)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RTCQuaternionDecomposition>())).scale_y as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCQuaternionDecomposition),
            "::",
            stringify!(scale_y)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RTCQuaternionDecomposition>())).scale_z as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCQuaternionDecomposition),
            "::",
            stringify!(scale_z)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RTCQuaternionDecomposition>())).skew_xy as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCQuaternionDecomposition),
            "::",
            stringify!(skew_xy)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RTCQuaternionDecomposition>())).skew_xz as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCQuaternionDecomposition),
            "::",
            stringify!(skew_xz)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RTCQuaternionDecomposition>())).skew_yz as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCQuaternionDecomposition),
            "::",
            stringify!(skew_yz)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RTCQuaternionDecomposition>())).shift_x as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCQuaternionDecomposition),
            "::",
            stringify!(shift_x)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RTCQuaternionDecomposition>())).shift_y as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCQuaternionDecomposition),
            "::",
            stringify!(shift_y)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RTCQuaternionDecomposition>())).shift_z as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCQuaternionDecomposition),
            "::",
            stringify!(shift_z)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RTCQuaternionDecomposition>())).quaternion_r as *const _ as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCQuaternionDecomposition),
            "::",
            stringify!(quaternion_r)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RTCQuaternionDecomposition>())).quaternion_i as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCQuaternionDecomposition),
            "::",
            stringify!(quaternion_i)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RTCQuaternionDecomposition>())).quaternion_j as *const _ as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCQuaternionDecomposition),
            "::",
            stringify!(quaternion_j)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RTCQuaternionDecomposition>())).quaternion_k as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCQuaternionDecomposition),
            "::",
            stringify!(quaternion_k)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RTCQuaternionDecomposition>())).translation_x as *const _
                as usize
        },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCQuaternionDecomposition),
            "::",
            stringify!(translation_x)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RTCQuaternionDecomposition>())).translation_y as *const _
                as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCQuaternionDecomposition),
            "::",
            stringify!(translation_y)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RTCQuaternionDecomposition>())).translation_z as *const _
                as usize
        },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCQuaternionDecomposition),
            "::",
            stringify!(translation_z)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RTCSceneTy {
    _unused: [u8; 0],
}
pub type RTCScene = *mut RTCSceneTy;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RTCGeometryTy {
    _unused: [u8; 0],
}
pub type RTCGeometry = *mut RTCGeometryTy;
pub const RTCGeometryType_RTC_GEOMETRY_TYPE_TRIANGLE: RTCGeometryType = 0;
pub const RTCGeometryType_RTC_GEOMETRY_TYPE_QUAD: RTCGeometryType = 1;
pub const RTCGeometryType_RTC_GEOMETRY_TYPE_GRID: RTCGeometryType = 2;
pub const RTCGeometryType_RTC_GEOMETRY_TYPE_SUBDIVISION: RTCGeometryType = 8;
pub const RTCGeometryType_RTC_GEOMETRY_TYPE_CONE_LINEAR_CURVE: RTCGeometryType = 15;
pub const RTCGeometryType_RTC_GEOMETRY_TYPE_ROUND_LINEAR_CURVE: RTCGeometryType = 16;
pub const RTCGeometryType_RTC_GEOMETRY_TYPE_FLAT_LINEAR_CURVE: RTCGeometryType = 17;
pub const RTCGeometryType_RTC_GEOMETRY_TYPE_ROUND_BEZIER_CURVE: RTCGeometryType = 24;
pub const RTCGeometryType_RTC_GEOMETRY_TYPE_FLAT_BEZIER_CURVE: RTCGeometryType = 25;
pub const RTCGeometryType_RTC_GEOMETRY_TYPE_NORMAL_ORIENTED_BEZIER_CURVE: RTCGeometryType = 26;
pub const RTCGeometryType_RTC_GEOMETRY_TYPE_ROUND_BSPLINE_CURVE: RTCGeometryType = 32;
pub const RTCGeometryType_RTC_GEOMETRY_TYPE_FLAT_BSPLINE_CURVE: RTCGeometryType = 33;
pub const RTCGeometryType_RTC_GEOMETRY_TYPE_NORMAL_ORIENTED_BSPLINE_CURVE: RTCGeometryType = 34;
pub const RTCGeometryType_RTC_GEOMETRY_TYPE_ROUND_HERMITE_CURVE: RTCGeometryType = 40;
pub const RTCGeometryType_RTC_GEOMETRY_TYPE_FLAT_HERMITE_CURVE: RTCGeometryType = 41;
pub const RTCGeometryType_RTC_GEOMETRY_TYPE_NORMAL_ORIENTED_HERMITE_CURVE: RTCGeometryType = 42;
pub const RTCGeometryType_RTC_GEOMETRY_TYPE_SPHERE_POINT: RTCGeometryType = 50;
pub const RTCGeometryType_RTC_GEOMETRY_TYPE_DISC_POINT: RTCGeometryType = 51;
pub const RTCGeometryType_RTC_GEOMETRY_TYPE_ORIENTED_DISC_POINT: RTCGeometryType = 52;
pub const RTCGeometryType_RTC_GEOMETRY_TYPE_ROUND_CATMULL_ROM_CURVE: RTCGeometryType = 58;
pub const RTCGeometryType_RTC_GEOMETRY_TYPE_FLAT_CATMULL_ROM_CURVE: RTCGeometryType = 59;
pub const RTCGeometryType_RTC_GEOMETRY_TYPE_NORMAL_ORIENTED_CATMULL_ROM_CURVE: RTCGeometryType = 60;
pub const RTCGeometryType_RTC_GEOMETRY_TYPE_USER: RTCGeometryType = 120;
pub const RTCGeometryType_RTC_GEOMETRY_TYPE_INSTANCE: RTCGeometryType = 121;
pub type RTCGeometryType = ::std::os::raw::c_int;
pub const RTCSubdivisionMode_RTC_SUBDIVISION_MODE_NO_BOUNDARY: RTCSubdivisionMode = 0;
pub const RTCSubdivisionMode_RTC_SUBDIVISION_MODE_SMOOTH_BOUNDARY: RTCSubdivisionMode = 1;
pub const RTCSubdivisionMode_RTC_SUBDIVISION_MODE_PIN_CORNERS: RTCSubdivisionMode = 2;
pub const RTCSubdivisionMode_RTC_SUBDIVISION_MODE_PIN_BOUNDARY: RTCSubdivisionMode = 3;
pub const RTCSubdivisionMode_RTC_SUBDIVISION_MODE_PIN_ALL: RTCSubdivisionMode = 4;
pub type RTCSubdivisionMode = ::std::os::raw::c_int;
pub const RTCCurveFlags_RTC_CURVE_FLAG_NEIGHBOR_LEFT: RTCCurveFlags = 1;
pub const RTCCurveFlags_RTC_CURVE_FLAG_NEIGHBOR_RIGHT: RTCCurveFlags = 2;
pub type RTCCurveFlags = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RTCBoundsFunctionArguments {
    pub geometryUserPtr: *mut ::std::os::raw::c_void,
    pub primID: ::std::os::raw::c_uint,
    pub timeStep: ::std::os::raw::c_uint,
    pub bounds_o: *mut RTCBounds,
}
#[test]
fn bindgen_test_layout_RTCBoundsFunctionArguments() {
    assert_eq!(
        ::std::mem::size_of::<RTCBoundsFunctionArguments>(),
        24usize,
        concat!("Size of: ", stringify!(RTCBoundsFunctionArguments))
    );
    assert_eq!(
        ::std::mem::align_of::<RTCBoundsFunctionArguments>(),
        8usize,
        concat!("Alignment of ", stringify!(RTCBoundsFunctionArguments))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RTCBoundsFunctionArguments>())).geometryUserPtr as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCBoundsFunctionArguments),
            "::",
            stringify!(geometryUserPtr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RTCBoundsFunctionArguments>())).primID as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCBoundsFunctionArguments),
            "::",
            stringify!(primID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RTCBoundsFunctionArguments>())).timeStep as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCBoundsFunctionArguments),
            "::",
            stringify!(timeStep)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RTCBoundsFunctionArguments>())).bounds_o as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCBoundsFunctionArguments),
            "::",
            stringify!(bounds_o)
        )
    );
}
pub type RTCBoundsFunction =
    ::std::option::Option<unsafe extern "C" fn(args: *const RTCBoundsFunctionArguments)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RTCIntersectFunctionNArguments {
    pub valid: *mut ::std::os::raw::c_int,
    pub geometryUserPtr: *mut ::std::os::raw::c_void,
    pub primID: ::std::os::raw::c_uint,
    pub context: *mut RTCIntersectContext,
    pub rayhit: *mut RTCRayHitN,
    pub N: ::std::os::raw::c_uint,
    pub geomID: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_RTCIntersectFunctionNArguments() {
    assert_eq!(
        ::std::mem::size_of::<RTCIntersectFunctionNArguments>(),
        48usize,
        concat!("Size of: ", stringify!(RTCIntersectFunctionNArguments))
    );
    assert_eq!(
        ::std::mem::align_of::<RTCIntersectFunctionNArguments>(),
        8usize,
        concat!("Alignment of ", stringify!(RTCIntersectFunctionNArguments))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RTCIntersectFunctionNArguments>())).valid as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCIntersectFunctionNArguments),
            "::",
            stringify!(valid)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RTCIntersectFunctionNArguments>())).geometryUserPtr as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCIntersectFunctionNArguments),
            "::",
            stringify!(geometryUserPtr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RTCIntersectFunctionNArguments>())).primID as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCIntersectFunctionNArguments),
            "::",
            stringify!(primID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RTCIntersectFunctionNArguments>())).context as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCIntersectFunctionNArguments),
            "::",
            stringify!(context)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RTCIntersectFunctionNArguments>())).rayhit as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCIntersectFunctionNArguments),
            "::",
            stringify!(rayhit)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RTCIntersectFunctionNArguments>())).N as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCIntersectFunctionNArguments),
            "::",
            stringify!(N)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RTCIntersectFunctionNArguments>())).geomID as *const _ as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCIntersectFunctionNArguments),
            "::",
            stringify!(geomID)
        )
    );
}
pub type RTCIntersectFunctionN =
    ::std::option::Option<unsafe extern "C" fn(args: *const RTCIntersectFunctionNArguments)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RTCOccludedFunctionNArguments {
    pub valid: *mut ::std::os::raw::c_int,
    pub geometryUserPtr: *mut ::std::os::raw::c_void,
    pub primID: ::std::os::raw::c_uint,
    pub context: *mut RTCIntersectContext,
    pub ray: *mut RTCRayN,
    pub N: ::std::os::raw::c_uint,
    pub geomID: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_RTCOccludedFunctionNArguments() {
    assert_eq!(
        ::std::mem::size_of::<RTCOccludedFunctionNArguments>(),
        48usize,
        concat!("Size of: ", stringify!(RTCOccludedFunctionNArguments))
    );
    assert_eq!(
        ::std::mem::align_of::<RTCOccludedFunctionNArguments>(),
        8usize,
        concat!("Alignment of ", stringify!(RTCOccludedFunctionNArguments))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RTCOccludedFunctionNArguments>())).valid as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCOccludedFunctionNArguments),
            "::",
            stringify!(valid)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RTCOccludedFunctionNArguments>())).geometryUserPtr as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCOccludedFunctionNArguments),
            "::",
            stringify!(geometryUserPtr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RTCOccludedFunctionNArguments>())).primID as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCOccludedFunctionNArguments),
            "::",
            stringify!(primID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RTCOccludedFunctionNArguments>())).context as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCOccludedFunctionNArguments),
            "::",
            stringify!(context)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RTCOccludedFunctionNArguments>())).ray as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCOccludedFunctionNArguments),
            "::",
            stringify!(ray)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCOccludedFunctionNArguments>())).N as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCOccludedFunctionNArguments),
            "::",
            stringify!(N)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RTCOccludedFunctionNArguments>())).geomID as *const _ as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCOccludedFunctionNArguments),
            "::",
            stringify!(geomID)
        )
    );
}
pub type RTCOccludedFunctionN =
    ::std::option::Option<unsafe extern "C" fn(args: *const RTCOccludedFunctionNArguments)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RTCDisplacementFunctionNArguments {
    pub geometryUserPtr: *mut ::std::os::raw::c_void,
    pub geometry: RTCGeometry,
    pub primID: ::std::os::raw::c_uint,
    pub timeStep: ::std::os::raw::c_uint,
    pub u: *const f32,
    pub v: *const f32,
    pub Ng_x: *const f32,
    pub Ng_y: *const f32,
    pub Ng_z: *const f32,
    pub P_x: *mut f32,
    pub P_y: *mut f32,
    pub P_z: *mut f32,
    pub N: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_RTCDisplacementFunctionNArguments() {
    assert_eq!(
        ::std::mem::size_of::<RTCDisplacementFunctionNArguments>(),
        96usize,
        concat!("Size of: ", stringify!(RTCDisplacementFunctionNArguments))
    );
    assert_eq!(
        ::std::mem::align_of::<RTCDisplacementFunctionNArguments>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(RTCDisplacementFunctionNArguments)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RTCDisplacementFunctionNArguments>())).geometryUserPtr
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCDisplacementFunctionNArguments),
            "::",
            stringify!(geometryUserPtr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RTCDisplacementFunctionNArguments>())).geometry as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCDisplacementFunctionNArguments),
            "::",
            stringify!(geometry)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RTCDisplacementFunctionNArguments>())).primID as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCDisplacementFunctionNArguments),
            "::",
            stringify!(primID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RTCDisplacementFunctionNArguments>())).timeStep as *const _
                as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCDisplacementFunctionNArguments),
            "::",
            stringify!(timeStep)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RTCDisplacementFunctionNArguments>())).u as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCDisplacementFunctionNArguments),
            "::",
            stringify!(u)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RTCDisplacementFunctionNArguments>())).v as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCDisplacementFunctionNArguments),
            "::",
            stringify!(v)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RTCDisplacementFunctionNArguments>())).Ng_x as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCDisplacementFunctionNArguments),
            "::",
            stringify!(Ng_x)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RTCDisplacementFunctionNArguments>())).Ng_y as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCDisplacementFunctionNArguments),
            "::",
            stringify!(Ng_y)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RTCDisplacementFunctionNArguments>())).Ng_z as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCDisplacementFunctionNArguments),
            "::",
            stringify!(Ng_z)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RTCDisplacementFunctionNArguments>())).P_x as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCDisplacementFunctionNArguments),
            "::",
            stringify!(P_x)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RTCDisplacementFunctionNArguments>())).P_y as *const _ as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCDisplacementFunctionNArguments),
            "::",
            stringify!(P_y)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RTCDisplacementFunctionNArguments>())).P_z as *const _ as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCDisplacementFunctionNArguments),
            "::",
            stringify!(P_z)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RTCDisplacementFunctionNArguments>())).N as *const _ as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCDisplacementFunctionNArguments),
            "::",
            stringify!(N)
        )
    );
}
pub type RTCDisplacementFunctionN =
    ::std::option::Option<unsafe extern "C" fn(args: *const RTCDisplacementFunctionNArguments)>;
extern "C" {
    pub fn rtcNewGeometry(device: RTCDevice, type_: RTCGeometryType) -> RTCGeometry;
}
extern "C" {
    pub fn rtcRetainGeometry(geometry: RTCGeometry);
}
extern "C" {
    pub fn rtcReleaseGeometry(geometry: RTCGeometry);
}
extern "C" {
    pub fn rtcCommitGeometry(geometry: RTCGeometry);
}
extern "C" {
    pub fn rtcEnableGeometry(geometry: RTCGeometry);
}
extern "C" {
    pub fn rtcDisableGeometry(geometry: RTCGeometry);
}
extern "C" {
    pub fn rtcSetGeometryTimeStepCount(
        geometry: RTCGeometry,
        timeStepCount: ::std::os::raw::c_uint,
    );
}
extern "C" {
    pub fn rtcSetGeometryTimeRange(geometry: RTCGeometry, startTime: f32, endTime: f32);
}
extern "C" {
    pub fn rtcSetGeometryVertexAttributeCount(
        geometry: RTCGeometry,
        vertexAttributeCount: ::std::os::raw::c_uint,
    );
}
extern "C" {
    pub fn rtcSetGeometryMask(geometry: RTCGeometry, mask: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn rtcSetGeometryBuildQuality(geometry: RTCGeometry, quality: RTCBuildQuality);
}
extern "C" {
    pub fn rtcSetGeometryMaxRadiusScale(geometry: RTCGeometry, maxRadiusScale: f32);
}
extern "C" {
    pub fn rtcSetGeometryBuffer(
        geometry: RTCGeometry,
        type_: RTCBufferType,
        slot: ::std::os::raw::c_uint,
        format: RTCFormat,
        buffer: RTCBuffer,
        byteOffset: size_t,
        byteStride: size_t,
        itemCount: size_t,
    );
}
extern "C" {
    pub fn rtcSetSharedGeometryBuffer(
        geometry: RTCGeometry,
        type_: RTCBufferType,
        slot: ::std::os::raw::c_uint,
        format: RTCFormat,
        ptr: *const ::std::os::raw::c_void,
        byteOffset: size_t,
        byteStride: size_t,
        itemCount: size_t,
    );
}
extern "C" {
    pub fn rtcSetNewGeometryBuffer(
        geometry: RTCGeometry,
        type_: RTCBufferType,
        slot: ::std::os::raw::c_uint,
        format: RTCFormat,
        byteStride: size_t,
        itemCount: size_t,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn rtcGetGeometryBufferData(
        geometry: RTCGeometry,
        type_: RTCBufferType,
        slot: ::std::os::raw::c_uint,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn rtcUpdateGeometryBuffer(
        geometry: RTCGeometry,
        type_: RTCBufferType,
        slot: ::std::os::raw::c_uint,
    );
}
extern "C" {
    pub fn rtcSetGeometryIntersectFilterFunction(geometry: RTCGeometry, filter: RTCFilterFunctionN);
}
extern "C" {
    pub fn rtcSetGeometryOccludedFilterFunction(geometry: RTCGeometry, filter: RTCFilterFunctionN);
}
extern "C" {
    pub fn rtcSetGeometryUserData(geometry: RTCGeometry, ptr: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn rtcGetGeometryUserData(geometry: RTCGeometry) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn rtcSetGeometryPointQueryFunction(
        geometry: RTCGeometry,
        pointQuery: RTCPointQueryFunction,
    );
}
extern "C" {
    pub fn rtcSetGeometryUserPrimitiveCount(
        geometry: RTCGeometry,
        userPrimitiveCount: ::std::os::raw::c_uint,
    );
}
extern "C" {
    pub fn rtcSetGeometryBoundsFunction(
        geometry: RTCGeometry,
        bounds: RTCBoundsFunction,
        userPtr: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    pub fn rtcSetGeometryIntersectFunction(geometry: RTCGeometry, intersect: RTCIntersectFunctionN);
}
extern "C" {
    pub fn rtcSetGeometryOccludedFunction(geometry: RTCGeometry, occluded: RTCOccludedFunctionN);
}
extern "C" {
    pub fn rtcFilterIntersection(
        args: *const RTCIntersectFunctionNArguments,
        filterArgs: *const RTCFilterFunctionNArguments,
    );
}
extern "C" {
    pub fn rtcFilterOcclusion(
        args: *const RTCOccludedFunctionNArguments,
        filterArgs: *const RTCFilterFunctionNArguments,
    );
}
extern "C" {
    pub fn rtcSetGeometryInstancedScene(geometry: RTCGeometry, scene: RTCScene);
}
extern "C" {
    pub fn rtcSetGeometryTransform(
        geometry: RTCGeometry,
        timeStep: ::std::os::raw::c_uint,
        format: RTCFormat,
        xfm: *const ::std::os::raw::c_void,
    );
}
extern "C" {
    pub fn rtcSetGeometryTransformQuaternion(
        geometry: RTCGeometry,
        timeStep: ::std::os::raw::c_uint,
        qd: *const RTCQuaternionDecomposition,
    );
}
extern "C" {
    pub fn rtcGetGeometryTransform(
        geometry: RTCGeometry,
        time: f32,
        format: RTCFormat,
        xfm: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    pub fn rtcSetGeometryTessellationRate(geometry: RTCGeometry, tessellationRate: f32);
}
extern "C" {
    pub fn rtcSetGeometryTopologyCount(
        geometry: RTCGeometry,
        topologyCount: ::std::os::raw::c_uint,
    );
}
extern "C" {
    pub fn rtcSetGeometrySubdivisionMode(
        geometry: RTCGeometry,
        topologyID: ::std::os::raw::c_uint,
        mode: RTCSubdivisionMode,
    );
}
extern "C" {
    pub fn rtcSetGeometryVertexAttributeTopology(
        geometry: RTCGeometry,
        vertexAttributeID: ::std::os::raw::c_uint,
        topologyID: ::std::os::raw::c_uint,
    );
}
extern "C" {
    pub fn rtcSetGeometryDisplacementFunction(
        geometry: RTCGeometry,
        displacement: RTCDisplacementFunctionN,
    );
}
extern "C" {
    pub fn rtcGetGeometryFirstHalfEdge(
        geometry: RTCGeometry,
        faceID: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn rtcGetGeometryFace(
        geometry: RTCGeometry,
        edgeID: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn rtcGetGeometryNextHalfEdge(
        geometry: RTCGeometry,
        edgeID: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn rtcGetGeometryPreviousHalfEdge(
        geometry: RTCGeometry,
        edgeID: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn rtcGetGeometryOppositeHalfEdge(
        geometry: RTCGeometry,
        topologyID: ::std::os::raw::c_uint,
        edgeID: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_uint;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RTCInterpolateArguments {
    pub geometry: RTCGeometry,
    pub primID: ::std::os::raw::c_uint,
    pub u: f32,
    pub v: f32,
    pub bufferType: RTCBufferType,
    pub bufferSlot: ::std::os::raw::c_uint,
    pub P: *mut f32,
    pub dPdu: *mut f32,
    pub dPdv: *mut f32,
    pub ddPdudu: *mut f32,
    pub ddPdvdv: *mut f32,
    pub ddPdudv: *mut f32,
    pub valueCount: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_RTCInterpolateArguments() {
    assert_eq!(
        ::std::mem::size_of::<RTCInterpolateArguments>(),
        88usize,
        concat!("Size of: ", stringify!(RTCInterpolateArguments))
    );
    assert_eq!(
        ::std::mem::align_of::<RTCInterpolateArguments>(),
        8usize,
        concat!("Alignment of ", stringify!(RTCInterpolateArguments))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RTCInterpolateArguments>())).geometry as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCInterpolateArguments),
            "::",
            stringify!(geometry)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCInterpolateArguments>())).primID as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCInterpolateArguments),
            "::",
            stringify!(primID)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCInterpolateArguments>())).u as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCInterpolateArguments),
            "::",
            stringify!(u)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCInterpolateArguments>())).v as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCInterpolateArguments),
            "::",
            stringify!(v)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RTCInterpolateArguments>())).bufferType as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCInterpolateArguments),
            "::",
            stringify!(bufferType)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RTCInterpolateArguments>())).bufferSlot as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCInterpolateArguments),
            "::",
            stringify!(bufferSlot)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCInterpolateArguments>())).P as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCInterpolateArguments),
            "::",
            stringify!(P)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCInterpolateArguments>())).dPdu as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCInterpolateArguments),
            "::",
            stringify!(dPdu)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCInterpolateArguments>())).dPdv as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCInterpolateArguments),
            "::",
            stringify!(dPdv)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCInterpolateArguments>())).ddPdudu as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCInterpolateArguments),
            "::",
            stringify!(ddPdudu)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCInterpolateArguments>())).ddPdvdv as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCInterpolateArguments),
            "::",
            stringify!(ddPdvdv)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCInterpolateArguments>())).ddPdudv as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCInterpolateArguments),
            "::",
            stringify!(ddPdudv)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RTCInterpolateArguments>())).valueCount as *const _ as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCInterpolateArguments),
            "::",
            stringify!(valueCount)
        )
    );
}
extern "C" {
    pub fn rtcInterpolate(args: *const RTCInterpolateArguments);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RTCInterpolateNArguments {
    pub geometry: RTCGeometry,
    pub valid: *const ::std::os::raw::c_void,
    pub primIDs: *const ::std::os::raw::c_uint,
    pub u: *const f32,
    pub v: *const f32,
    pub N: ::std::os::raw::c_uint,
    pub bufferType: RTCBufferType,
    pub bufferSlot: ::std::os::raw::c_uint,
    pub P: *mut f32,
    pub dPdu: *mut f32,
    pub dPdv: *mut f32,
    pub ddPdudu: *mut f32,
    pub ddPdvdv: *mut f32,
    pub ddPdudv: *mut f32,
    pub valueCount: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_RTCInterpolateNArguments() {
    assert_eq!(
        ::std::mem::size_of::<RTCInterpolateNArguments>(),
        112usize,
        concat!("Size of: ", stringify!(RTCInterpolateNArguments))
    );
    assert_eq!(
        ::std::mem::align_of::<RTCInterpolateNArguments>(),
        8usize,
        concat!("Alignment of ", stringify!(RTCInterpolateNArguments))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RTCInterpolateNArguments>())).geometry as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCInterpolateNArguments),
            "::",
            stringify!(geometry)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCInterpolateNArguments>())).valid as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCInterpolateNArguments),
            "::",
            stringify!(valid)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RTCInterpolateNArguments>())).primIDs as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCInterpolateNArguments),
            "::",
            stringify!(primIDs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCInterpolateNArguments>())).u as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCInterpolateNArguments),
            "::",
            stringify!(u)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCInterpolateNArguments>())).v as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCInterpolateNArguments),
            "::",
            stringify!(v)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCInterpolateNArguments>())).N as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCInterpolateNArguments),
            "::",
            stringify!(N)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RTCInterpolateNArguments>())).bufferType as *const _ as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCInterpolateNArguments),
            "::",
            stringify!(bufferType)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RTCInterpolateNArguments>())).bufferSlot as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCInterpolateNArguments),
            "::",
            stringify!(bufferSlot)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCInterpolateNArguments>())).P as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCInterpolateNArguments),
            "::",
            stringify!(P)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCInterpolateNArguments>())).dPdu as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCInterpolateNArguments),
            "::",
            stringify!(dPdu)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCInterpolateNArguments>())).dPdv as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCInterpolateNArguments),
            "::",
            stringify!(dPdv)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RTCInterpolateNArguments>())).ddPdudu as *const _ as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCInterpolateNArguments),
            "::",
            stringify!(ddPdudu)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RTCInterpolateNArguments>())).ddPdvdv as *const _ as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCInterpolateNArguments),
            "::",
            stringify!(ddPdvdv)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RTCInterpolateNArguments>())).ddPdudv as *const _ as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCInterpolateNArguments),
            "::",
            stringify!(ddPdudv)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RTCInterpolateNArguments>())).valueCount as *const _ as usize
        },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCInterpolateNArguments),
            "::",
            stringify!(valueCount)
        )
    );
}
extern "C" {
    pub fn rtcInterpolateN(args: *const RTCInterpolateNArguments);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RTCGrid {
    pub startVertexID: ::std::os::raw::c_uint,
    pub stride: ::std::os::raw::c_uint,
    pub width: ::std::os::raw::c_ushort,
    pub height: ::std::os::raw::c_ushort,
}
#[test]
fn bindgen_test_layout_RTCGrid() {
    assert_eq!(
        ::std::mem::size_of::<RTCGrid>(),
        12usize,
        concat!("Size of: ", stringify!(RTCGrid))
    );
    assert_eq!(
        ::std::mem::align_of::<RTCGrid>(),
        4usize,
        concat!("Alignment of ", stringify!(RTCGrid))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCGrid>())).startVertexID as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCGrid),
            "::",
            stringify!(startVertexID)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCGrid>())).stride as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCGrid),
            "::",
            stringify!(stride)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCGrid>())).width as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCGrid),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCGrid>())).height as *const _ as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCGrid),
            "::",
            stringify!(height)
        )
    );
}
pub const RTCSceneFlags_RTC_SCENE_FLAG_NONE: RTCSceneFlags = 0;
pub const RTCSceneFlags_RTC_SCENE_FLAG_DYNAMIC: RTCSceneFlags = 1;
pub const RTCSceneFlags_RTC_SCENE_FLAG_COMPACT: RTCSceneFlags = 2;
pub const RTCSceneFlags_RTC_SCENE_FLAG_ROBUST: RTCSceneFlags = 4;
pub const RTCSceneFlags_RTC_SCENE_FLAG_CONTEXT_FILTER_FUNCTION: RTCSceneFlags = 8;
pub type RTCSceneFlags = ::std::os::raw::c_int;
extern "C" {
    pub fn rtcNewScene(device: RTCDevice) -> RTCScene;
}
extern "C" {
    pub fn rtcGetSceneDevice(hscene: RTCScene) -> RTCDevice;
}
extern "C" {
    pub fn rtcRetainScene(scene: RTCScene);
}
extern "C" {
    pub fn rtcReleaseScene(scene: RTCScene);
}
extern "C" {
    pub fn rtcAttachGeometry(scene: RTCScene, geometry: RTCGeometry) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn rtcAttachGeometryByID(
        scene: RTCScene,
        geometry: RTCGeometry,
        geomID: ::std::os::raw::c_uint,
    );
}
extern "C" {
    pub fn rtcDetachGeometry(scene: RTCScene, geomID: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn rtcGetGeometry(scene: RTCScene, geomID: ::std::os::raw::c_uint) -> RTCGeometry;
}
extern "C" {
    pub fn rtcGetGeometryThreadSafe(scene: RTCScene, geomID: ::std::os::raw::c_uint)
        -> RTCGeometry;
}
extern "C" {
    pub fn rtcCommitScene(scene: RTCScene);
}
extern "C" {
    pub fn rtcJoinCommitScene(scene: RTCScene);
}
pub type RTCProgressMonitorFunction =
    ::std::option::Option<unsafe extern "C" fn(ptr: *mut ::std::os::raw::c_void, n: f64) -> bool>;
extern "C" {
    pub fn rtcSetSceneProgressMonitorFunction(
        scene: RTCScene,
        progress: RTCProgressMonitorFunction,
        ptr: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    pub fn rtcSetSceneBuildQuality(scene: RTCScene, quality: RTCBuildQuality);
}
extern "C" {
    pub fn rtcSetSceneFlags(scene: RTCScene, flags: RTCSceneFlags);
}
extern "C" {
    pub fn rtcGetSceneFlags(scene: RTCScene) -> RTCSceneFlags;
}
extern "C" {
    pub fn rtcGetSceneBounds(scene: RTCScene, bounds_o: *mut RTCBounds);
}
extern "C" {
    pub fn rtcGetSceneLinearBounds(scene: RTCScene, bounds_o: *mut RTCLinearBounds);
}
extern "C" {
    pub fn rtcPointQuery(
        scene: RTCScene,
        query: *mut RTCPointQuery,
        context: *mut RTCPointQueryContext,
        queryFunc: RTCPointQueryFunction,
        userPtr: *mut ::std::os::raw::c_void,
    ) -> bool;
}
extern "C" {
    pub fn rtcPointQuery4(
        valid: *const ::std::os::raw::c_int,
        scene: RTCScene,
        query: *mut RTCPointQuery4,
        context: *mut RTCPointQueryContext,
        queryFunc: RTCPointQueryFunction,
        userPtr: *mut *mut ::std::os::raw::c_void,
    ) -> bool;
}
extern "C" {
    pub fn rtcPointQuery8(
        valid: *const ::std::os::raw::c_int,
        scene: RTCScene,
        query: *mut RTCPointQuery8,
        context: *mut RTCPointQueryContext,
        queryFunc: RTCPointQueryFunction,
        userPtr: *mut *mut ::std::os::raw::c_void,
    ) -> bool;
}
extern "C" {
    pub fn rtcPointQuery16(
        valid: *const ::std::os::raw::c_int,
        scene: RTCScene,
        query: *mut RTCPointQuery16,
        context: *mut RTCPointQueryContext,
        queryFunc: RTCPointQueryFunction,
        userPtr: *mut *mut ::std::os::raw::c_void,
    ) -> bool;
}
extern "C" {
    pub fn rtcIntersect1(
        scene: RTCScene,
        context: *mut RTCIntersectContext,
        rayhit: *mut RTCRayHit,
    );
}
extern "C" {
    pub fn rtcIntersect4(
        valid: *const ::std::os::raw::c_int,
        scene: RTCScene,
        context: *mut RTCIntersectContext,
        rayhit: *mut RTCRayHit4,
    );
}
extern "C" {
    pub fn rtcIntersect8(
        valid: *const ::std::os::raw::c_int,
        scene: RTCScene,
        context: *mut RTCIntersectContext,
        rayhit: *mut RTCRayHit8,
    );
}
extern "C" {
    pub fn rtcIntersect16(
        valid: *const ::std::os::raw::c_int,
        scene: RTCScene,
        context: *mut RTCIntersectContext,
        rayhit: *mut RTCRayHit16,
    );
}
extern "C" {
    pub fn rtcIntersect1M(
        scene: RTCScene,
        context: *mut RTCIntersectContext,
        rayhit: *mut RTCRayHit,
        M: ::std::os::raw::c_uint,
        byteStride: size_t,
    );
}
extern "C" {
    pub fn rtcIntersect1Mp(
        scene: RTCScene,
        context: *mut RTCIntersectContext,
        rayhit: *mut *mut RTCRayHit,
        M: ::std::os::raw::c_uint,
    );
}
extern "C" {
    pub fn rtcIntersectNM(
        scene: RTCScene,
        context: *mut RTCIntersectContext,
        rayhit: *mut RTCRayHitN,
        N: ::std::os::raw::c_uint,
        M: ::std::os::raw::c_uint,
        byteStride: size_t,
    );
}
extern "C" {
    pub fn rtcIntersectNp(
        scene: RTCScene,
        context: *mut RTCIntersectContext,
        rayhit: *const RTCRayHitNp,
        N: ::std::os::raw::c_uint,
    );
}
extern "C" {
    pub fn rtcOccluded1(scene: RTCScene, context: *mut RTCIntersectContext, ray: *mut RTCRay);
}
extern "C" {
    pub fn rtcOccluded4(
        valid: *const ::std::os::raw::c_int,
        scene: RTCScene,
        context: *mut RTCIntersectContext,
        ray: *mut RTCRay4,
    );
}
extern "C" {
    pub fn rtcOccluded8(
        valid: *const ::std::os::raw::c_int,
        scene: RTCScene,
        context: *mut RTCIntersectContext,
        ray: *mut RTCRay8,
    );
}
extern "C" {
    pub fn rtcOccluded16(
        valid: *const ::std::os::raw::c_int,
        scene: RTCScene,
        context: *mut RTCIntersectContext,
        ray: *mut RTCRay16,
    );
}
extern "C" {
    pub fn rtcOccluded1M(
        scene: RTCScene,
        context: *mut RTCIntersectContext,
        ray: *mut RTCRay,
        M: ::std::os::raw::c_uint,
        byteStride: size_t,
    );
}
extern "C" {
    pub fn rtcOccluded1Mp(
        scene: RTCScene,
        context: *mut RTCIntersectContext,
        ray: *mut *mut RTCRay,
        M: ::std::os::raw::c_uint,
    );
}
extern "C" {
    pub fn rtcOccludedNM(
        scene: RTCScene,
        context: *mut RTCIntersectContext,
        ray: *mut RTCRayN,
        N: ::std::os::raw::c_uint,
        M: ::std::os::raw::c_uint,
        byteStride: size_t,
    );
}
extern "C" {
    pub fn rtcOccludedNp(
        scene: RTCScene,
        context: *mut RTCIntersectContext,
        ray: *const RTCRayNp,
        N: ::std::os::raw::c_uint,
    );
}
#[doc = " collision callback"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RTCCollision {
    pub geomID0: ::std::os::raw::c_uint,
    pub primID0: ::std::os::raw::c_uint,
    pub geomID1: ::std::os::raw::c_uint,
    pub primID1: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_RTCCollision() {
    assert_eq!(
        ::std::mem::size_of::<RTCCollision>(),
        16usize,
        concat!("Size of: ", stringify!(RTCCollision))
    );
    assert_eq!(
        ::std::mem::align_of::<RTCCollision>(),
        4usize,
        concat!("Alignment of ", stringify!(RTCCollision))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCCollision>())).geomID0 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCCollision),
            "::",
            stringify!(geomID0)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCCollision>())).primID0 as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCCollision),
            "::",
            stringify!(primID0)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCCollision>())).geomID1 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCCollision),
            "::",
            stringify!(geomID1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCCollision>())).primID1 as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCCollision),
            "::",
            stringify!(primID1)
        )
    );
}
pub type RTCCollideFunc = ::std::option::Option<
    unsafe extern "C" fn(
        userPtr: *mut ::std::os::raw::c_void,
        collisions: *mut RTCCollision,
        num_collisions: ::std::os::raw::c_uint,
    ),
>;
extern "C" {
    #[doc = " Performs collision detection of two scenes"]
    pub fn rtcCollide(
        scene0: RTCScene,
        scene1: RTCScene,
        callback: RTCCollideFunc,
        userPtr: *mut ::std::os::raw::c_void,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RTCBVHTy {
    _unused: [u8; 0],
}
pub type RTCBVH = *mut RTCBVHTy;
#[repr(C)]
#[repr(align(32))]
#[derive(Debug, Copy, Clone)]
pub struct RTCBuildPrimitive {
    pub lower_x: f32,
    pub lower_y: f32,
    pub lower_z: f32,
    pub geomID: ::std::os::raw::c_uint,
    pub upper_x: f32,
    pub upper_y: f32,
    pub upper_z: f32,
    pub primID: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_RTCBuildPrimitive() {
    assert_eq!(
        ::std::mem::size_of::<RTCBuildPrimitive>(),
        32usize,
        concat!("Size of: ", stringify!(RTCBuildPrimitive))
    );
    assert_eq!(
        ::std::mem::align_of::<RTCBuildPrimitive>(),
        32usize,
        concat!("Alignment of ", stringify!(RTCBuildPrimitive))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCBuildPrimitive>())).lower_x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCBuildPrimitive),
            "::",
            stringify!(lower_x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCBuildPrimitive>())).lower_y as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCBuildPrimitive),
            "::",
            stringify!(lower_y)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCBuildPrimitive>())).lower_z as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCBuildPrimitive),
            "::",
            stringify!(lower_z)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCBuildPrimitive>())).geomID as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCBuildPrimitive),
            "::",
            stringify!(geomID)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCBuildPrimitive>())).upper_x as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCBuildPrimitive),
            "::",
            stringify!(upper_x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCBuildPrimitive>())).upper_y as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCBuildPrimitive),
            "::",
            stringify!(upper_y)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCBuildPrimitive>())).upper_z as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCBuildPrimitive),
            "::",
            stringify!(upper_z)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCBuildPrimitive>())).primID as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCBuildPrimitive),
            "::",
            stringify!(primID)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RTCThreadLocalAllocatorTy {
    _unused: [u8; 0],
}
pub type RTCThreadLocalAllocator = *mut RTCThreadLocalAllocatorTy;
pub type RTCCreateNodeFunction = ::std::option::Option<
    unsafe extern "C" fn(
        allocator: RTCThreadLocalAllocator,
        childCount: ::std::os::raw::c_uint,
        userPtr: *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void,
>;
pub type RTCSetNodeChildrenFunction = ::std::option::Option<
    unsafe extern "C" fn(
        nodePtr: *mut ::std::os::raw::c_void,
        children: *mut *mut ::std::os::raw::c_void,
        childCount: ::std::os::raw::c_uint,
        userPtr: *mut ::std::os::raw::c_void,
    ),
>;
pub type RTCSetNodeBoundsFunction = ::std::option::Option<
    unsafe extern "C" fn(
        nodePtr: *mut ::std::os::raw::c_void,
        bounds: *mut *const RTCBounds,
        childCount: ::std::os::raw::c_uint,
        userPtr: *mut ::std::os::raw::c_void,
    ),
>;
pub type RTCCreateLeafFunction = ::std::option::Option<
    unsafe extern "C" fn(
        allocator: RTCThreadLocalAllocator,
        primitives: *const RTCBuildPrimitive,
        primitiveCount: size_t,
        userPtr: *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void,
>;
pub type RTCSplitPrimitiveFunction = ::std::option::Option<
    unsafe extern "C" fn(
        primitive: *const RTCBuildPrimitive,
        dimension: ::std::os::raw::c_uint,
        position: f32,
        leftBounds: *mut RTCBounds,
        rightBounds: *mut RTCBounds,
        userPtr: *mut ::std::os::raw::c_void,
    ),
>;
pub const RTCBuildFlags_RTC_BUILD_FLAG_NONE: RTCBuildFlags = 0;
pub const RTCBuildFlags_RTC_BUILD_FLAG_DYNAMIC: RTCBuildFlags = 1;
pub type RTCBuildFlags = ::std::os::raw::c_int;
pub const RTCBuildConstants_RTC_BUILD_MAX_PRIMITIVES_PER_LEAF: RTCBuildConstants = 32;
pub type RTCBuildConstants = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RTCBuildArguments {
    pub byteSize: size_t,
    pub buildQuality: RTCBuildQuality,
    pub buildFlags: RTCBuildFlags,
    pub maxBranchingFactor: ::std::os::raw::c_uint,
    pub maxDepth: ::std::os::raw::c_uint,
    pub sahBlockSize: ::std::os::raw::c_uint,
    pub minLeafSize: ::std::os::raw::c_uint,
    pub maxLeafSize: ::std::os::raw::c_uint,
    pub traversalCost: f32,
    pub intersectionCost: f32,
    pub bvh: RTCBVH,
    pub primitives: *mut RTCBuildPrimitive,
    pub primitiveCount: size_t,
    pub primitiveArrayCapacity: size_t,
    pub createNode: RTCCreateNodeFunction,
    pub setNodeChildren: RTCSetNodeChildrenFunction,
    pub setNodeBounds: RTCSetNodeBoundsFunction,
    pub createLeaf: RTCCreateLeafFunction,
    pub splitPrimitive: RTCSplitPrimitiveFunction,
    pub buildProgress: RTCProgressMonitorFunction,
    pub userPtr: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_RTCBuildArguments() {
    assert_eq!(
        ::std::mem::size_of::<RTCBuildArguments>(),
        136usize,
        concat!("Size of: ", stringify!(RTCBuildArguments))
    );
    assert_eq!(
        ::std::mem::align_of::<RTCBuildArguments>(),
        8usize,
        concat!("Alignment of ", stringify!(RTCBuildArguments))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCBuildArguments>())).byteSize as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCBuildArguments),
            "::",
            stringify!(byteSize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCBuildArguments>())).buildQuality as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCBuildArguments),
            "::",
            stringify!(buildQuality)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCBuildArguments>())).buildFlags as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCBuildArguments),
            "::",
            stringify!(buildFlags)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RTCBuildArguments>())).maxBranchingFactor as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCBuildArguments),
            "::",
            stringify!(maxBranchingFactor)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCBuildArguments>())).maxDepth as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCBuildArguments),
            "::",
            stringify!(maxDepth)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCBuildArguments>())).sahBlockSize as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCBuildArguments),
            "::",
            stringify!(sahBlockSize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCBuildArguments>())).minLeafSize as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCBuildArguments),
            "::",
            stringify!(minLeafSize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCBuildArguments>())).maxLeafSize as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCBuildArguments),
            "::",
            stringify!(maxLeafSize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCBuildArguments>())).traversalCost as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCBuildArguments),
            "::",
            stringify!(traversalCost)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RTCBuildArguments>())).intersectionCost as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCBuildArguments),
            "::",
            stringify!(intersectionCost)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCBuildArguments>())).bvh as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCBuildArguments),
            "::",
            stringify!(bvh)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCBuildArguments>())).primitives as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCBuildArguments),
            "::",
            stringify!(primitives)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RTCBuildArguments>())).primitiveCount as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCBuildArguments),
            "::",
            stringify!(primitiveCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RTCBuildArguments>())).primitiveArrayCapacity as *const _
                as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCBuildArguments),
            "::",
            stringify!(primitiveArrayCapacity)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCBuildArguments>())).createNode as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCBuildArguments),
            "::",
            stringify!(createNode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RTCBuildArguments>())).setNodeChildren as *const _ as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCBuildArguments),
            "::",
            stringify!(setNodeChildren)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCBuildArguments>())).setNodeBounds as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCBuildArguments),
            "::",
            stringify!(setNodeBounds)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCBuildArguments>())).createLeaf as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCBuildArguments),
            "::",
            stringify!(createLeaf)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<RTCBuildArguments>())).splitPrimitive as *const _ as usize
        },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCBuildArguments),
            "::",
            stringify!(splitPrimitive)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCBuildArguments>())).buildProgress as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCBuildArguments),
            "::",
            stringify!(buildProgress)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RTCBuildArguments>())).userPtr as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(RTCBuildArguments),
            "::",
            stringify!(userPtr)
        )
    );
}
extern "C" {
    pub fn rtcNewBVH(device: RTCDevice) -> RTCBVH;
}
extern "C" {
    pub fn rtcBuildBVH(args: *const RTCBuildArguments) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn rtcThreadLocalAlloc(
        allocator: RTCThreadLocalAllocator,
        bytes: size_t,
        align: size_t,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn rtcRetainBVH(bvh: RTCBVH);
}
extern "C" {
    pub fn rtcReleaseBVH(bvh: RTCBVH);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __crt_locale_data {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __crt_multibyte_data {
    pub _address: u8,
}
